{
"items": [
{"Id": 1, "Ques": ["What is Filename injection Path traversel ?", "What does Filename injection Path traversel mean ?", "Tell me something about Filename injection Path traversel ?", "Filename injection Path traversel"],"Ans": "A Path Traversal attack aims to access files and directories that are stored outside the web root folder. By browsing the application, the attacker looks for absolute links to files stored on the web server. By manipulating variables that reference files with dotdotslash (../); sequences and its variations, it may be possible to access arbitrary files and directories stored on file system, including application source code, configuration, and critical system files, limited by system operational access control. The attacker uses  ../../ sequences to move up to root directory, thus permitting navigation through the file system. This attack can be executed with an external malicious code injected on the path, like the Resource Injection attack."},
{"Id": 2, "Ques": ["What is xss injection ?", "What does xss injection mean ?", "Tell me something about xss injection ?", "xss injection"],"Ans": "Every time the application gets userinput, whether this showing it on screen or processing\nthis data in the application background, these parameters should be escaped for malicious\ncode in order to prevent crosssite scripting injections.\nWhen an attacker gains the possibility to perform an XSS injection,\nhe is given the opportunity to inject HTML and JavaScript code directly into the\napplication. This could lead to accounts being compromised by stealing session cookies or directly affect the operation of the target application."},
{"Id": 3, "Ques": ["What is Command injection ?", "What does Command injection mean ?", "Tell me something about Command injection ?", "Command injection"],"Ans": "Command injection is an attack in which the goal is execution of arbitrary commands on\nthe host operating system via a vulnerable application. Command injection attacks are\npossible when an application passes unsafe user supplied data\n(forms, cookies, HTTP headers etc.) to a system shell. In this attack,\nthe attackersupplied operating system commands are usually executed with the privileges\nof the vulnerable application. Command injection attacks are possible largely due to\ninsufficient input validation. This attack differs from Code Injection, in that code\ninjection allows the attacker to adds his own code that is then executed by the application.\nIn Code Injection, the attacker extends the default functionality of the application\nwithout the necessity of executing system commands."},
{"Id": 4, "Ques": ["What is Cross site request forgery ?", "What does Cross site request forgery mean ?", "Tell me something about Cross site request forgery ?", "Cross site request forgery"],"Ans": "CrossSite Request Forgery (CSRF) is a type of attack that occurs when a malicious Web site,\nemail, blog, instant message, or program causes a users Web browser to perform an unwanted\naction on a trusted site for which the user is currently authenticated."},
{"Id": 5, "Ques": ["What is XXE injections ?", "What does XXE injections mean ?", "Tell me something about XXE injections ?", "XXE injections"],"Ans": "Processing of an Xml eXternal Entity containing tainted data may lead to the disclosure of\nconfidential information and other system impacts.\nThe XML 1.0 standard defines the structure of an XML document.\nThe standard defines a concept called an entity, which is a storage unit of some type."},
{"Id": 6, "Ques": ["What is X Path injections ?", "What does X Path injections mean ?", "Tell me something about X Path injections ?", "X Path injections"],"Ans": "Web applications heavily use databases to store and access the data they need for their\noperations. Historically, relational databases have been by far the most common\ntechnology for data storage, but in the last years, we are witnessing an increasing\npopularity for databases that organise data using the XML language.\nJust like relational databases are accessed via SQL language, XML databases use XPath as\ntheir standard query language."},
{"Id": 7, "Ques": ["What is XML injection ?", "What does XML injection mean ?", "Tell me something about XML injection ?", "XML injection"],"Ans": "XML Injection is an attack technique used to manipulate or compromise the logic of an XML\napplication or service. The injection of unintended XML content and/or structures into\nan XML message can alter the intended logic of the application. Further, XML injection\ncan cause the insertion of malicious content into the resulting message/document."},
{"Id": 8, "Ques": ["What is XSLT injections ?", "What does XSLT injections mean ?", "Tell me something about XSLT injections ?", "XSLT injections"],"Ans": "A vulnerability occurs when an XSL file is loaded from a source controlled by an attacker.\nWhen the attacker is given the opportunity to specify the source of the included XSL file\nhe could include a file which contains malicious code to be parsed on the target application.\nThis could lead to, code execution, reading arbitrary files and many more\nvulnerabilities such as XSS."},
{"Id": 9, "Ques": ["What is External DTD parsing ?", "What does External DTD parsing mean ?", "Tell me something about External DTD parsing ?", "External DTD parsing"],"Ans": "Processing of an external entity containing tainted data may lead to the disclosure of confidential information and other system impacts. The XML 1.0 standard defines the structure of an XML document. The standard defines a concept called an entity, which is a storage unit of some type. There exists a specific type of entity, an external general parsed entity often shortened to an external entity that can access local or remote content via a declared system identifier. The system identifier is assumed to be a URI that can be dereferenced (accessed) by the XML processor when processing the entity.\nThe XML processor then replaces occurrences of the named external entity with the contents dereferenced by the system identifier. If the system identifier contains tainted data and the XML processor dereferences this tainted data, the XML processor may disclose confidential information normally not accessible by the application. Attacks can include disclosing local files, which may contain sensitive data such as passwords or private user data, using file: schemes or relative paths in the system identifier.\nSince the attack occurs relative to the application processing the XML document, an attacker may use this trusted application to pivot to other internal systems, possibly disclosing other internal content via HTTP(s) requests. In some situations, an XML processor library that is vulnerable to clientside memory corruption issues may be exploited by dereferencing a malicious URI, possibly allowing arbitrary code execution under the application account. Other attacks can access local resources that may not stop returning data, possibly impacting application availability if too many threads or processes are not released."},
{"Id": 10, "Ques": ["What is LDAP injection ?", "What does LDAP injection mean ?", "Tell me something about LDAP injection ?", "LDAP injection"],"Ans": "LDAP (Lightweight Directory Access Protocol) Injection is an attack used to exploit web based applications that construct LDAP statements based on user input. When an application fails to properly sanitize user input, it is possible to modify LDAP statements using a local proxy. This could result in the execution of arbitrary commands such as granting permissions to unauthorized queries, and content modification inside the LDAP tree. The same advanced exploitation techniques available in SQL Injection can be similarly applied in LDAP Injection."},
{"Id": 11, "Ques": ["What is SSI injections ?", "What does SSI injections mean ?", "Tell me something about SSI injections ?", "SSI injections"],"Ans": "Web servers usually give developers the ability to add small pieces of dynamic code inside\nstatic HTML pages, without having to deal with fullfledged serverside\nor clientside languages."},
{"Id": 12, "Ques": ["What is File upload injections ?", "What does File upload injections mean ?", "Tell me something about File upload injections ?", "File upload injections"],"Ans": "Uploaded files represent a significant risk to applications.\nThe first step in many attacks is to get some code to the system to be attacked.\nThen the attack only needs to find a way to get the code executed. Using a file upload\nhelps the attacker accomplish the first step."},
{"Id": 13, "Ques": ["What is Version management ?", "What does Version management mean ?", "Tell me something about Version management ?", "Version management"],"Ans": "Whenever a programmer decides to use third party software,\nhe should keep an eye implementing a proper version management methodology for this software.\nWhen hackers discover vulnerabilities they often publish these exploits online in order\nto push the developers of this software to fix their issues. As a result,\nwhen your software is not upgraded to the latest available version,\nscript kiddies could easily compromise your application by following the\nexploit tutorials online, thus compromising your application."},
{"Id": 14, "Ques": ["What is Verbose error messaging ?", "What does Verbose error messaging mean ?", "Tell me something about Verbose error messaging ?", "Verbose error messaging"],"Ans": "In the development stage of an application, programmers add debugging information in order to debug certain functionalities. However, this stage often displays sensitive technical information. If an attacker gains this technical information, he can learn more about the operation of the application. The application should always display userfriendly messages only when put in a live environment."},
{"Id": 15, "Ques": ["What is Debug enabeling ?", "What does Debug enabeling mean ?", "Tell me something about Debug enabeling ?", "Debug enabeling"],"Ans": "Sometimes it is possible through an \"enabling debug parameter\" to display technical\ninformation within the application. As a result, the attacker learns more about the\noperation of the application, increasing his attack vector."},
{"Id": 16, "Ques": ["What is Robots.txt ?", "What does Robots.txt mean ?", "Tell me something about Robots.txt ?", "Robots.txt"],"Ans": "Each site uses a robots.txt file which allows search engines to provide information.\nThe robots.txt determines what pages may or may not be indexed by google or yahoo etc.\nHowever, a common mistake made by programmers is applying a blacklisting method causing\nthe application displaying sensitive information to attackers."},
{"Id": 17, "Ques": ["What is Accessible non parsed dynamic scripts ?", "What does Accessible non parsed dynamic scripts mean ?", "Tell me something about Accessible non parsed dynamic scripts ?", "Accessible non parsed dynamic scripts"],"Ans": "Applications often include files in other pages. When these files can be directly\napproached by normal users, the operation of the application can be traced because the\nsource code becomes available. This improves the possibility that the attacker discovers\nvulnerabilities."},
{"Id": 18, "Ques": ["What is Include anti ?", "What does Include anti mean ?", "Tell me something about Include anti ?", "Include anti"],"Ans": "Anticaching headers have the ability to tell the browser,\ncomputer and proxies what information they may or may not store on the intermediate media"},
{"Id": 19, "Ques": ["What is Include anti clickjacking headers ?", "What does Include anti clickjacking headers mean ?", "Tell me something about Include anti clickjacking headers ?", "Include anti clickjacking headers"],"Ans": "Clickjacking, also known as a \"UI redress attack\", is when an attacker uses multiple\ntransparent or opaque layers to trick a user into clicking on a button or link on another\npage when they were intending to click on the top level page. Thus, the attacker is\n\"hijacking\" clicks meant for their page and routing them to another page, most likely\nowned by another application, domain, or both."},
{"Id": 20, "Ques": ["What is Include X XSS ?", "What does Include X XSS mean ?", "Tell me something about Include X XSS ?", "Include X XSS"],"Ans": "This header enables the Crosssite scripting (XSS) filter built into most recent\nweb browsers. It is usually enabled by default anyway, so the role of this header is to reenable the filter for this particular website if it was disabled by the user. This header is supported in IE 8 and in Chrome 4."},
{"Id": 21, "Ques": ["What is Include X Content Type Options header ?", "What does Include X Content Type Options header mean ?", "Tell me something about Include X Content Type Options header ?", "Include X Content Type Options header"],"Ans": "The only defined value, nosniff, prevents Internet Explorer and Google Chrome from\nMIMEsniffing a response away from the declared contenttype.\nThis also applies to Google Chrome, when downloading extensions.\nThis reduces exposure to driveby download attacks and sites serving user uploaded\ncontent that, by clever naming, could be treated by MSIE as executable or dynamic HTML\nfiles."},
{"Id": 22, "Ques": ["What is Include Strict Transport Security header ?", "What does Include Strict Transport Security header mean ?", "Tell me something about Include Strict Transport Security header ?", "Include Strict Transport Security header"],"Ans": "HTTP StrictTransportSecurity (HSTS) enforces secure (HTTP over SSL/TLS) connections to\nthe server. This reduces the impact of bugs in web applications leaking session data through\ncookies and external links and defends against Maninthemiddle attacks. HSTS also\ndisables the ability for user's to ignore SSL negotiation warnings"},
{"Id": 23, "Ques": ["What is sensitive information stored in cookies ?", "What does sensitive information stored in cookies mean ?", "Tell me something about sensitive information stored in cookies ?", "sensitive information stored in cookies"],"Ans": "Sensitive data should not be stored in a cookie,because the cookie is also used on the clientside and is adaptable thus making\nits content readable. A hacker could gain access to a cookie through cross site scripting\nattacks and gain the sensitive information stored\nin the targets cookie."},
{"Id": 24, "Ques": ["What is Client side state management ?", "What does Client side state management mean ?", "Tell me something about Client side state management ?", "Client side state management"],"Ans": "An application can implement all kinds of logic rules through JavaScript and HTML.\nHowever, these are clientside constraints that a hacker can easily disable or modify."},
{"Id": 25, "Ques": ["What is Too verbose authentication ?", "What does Too verbose authentication mean ?", "Tell me something about Too verbose authentication ?", "Too verbose authentication"],"Ans": "The error messages that are displayed when a user fails to login into an application\nshould be selected with caution. When this error message gives away too much information,\nthis information can be exploited by a hacker."},
{"Id": 26, "Ques": ["What is Brute force password guessing ?", "What does Brute force password guessing mean ?", "Tell me something about Brute force password guessing ?", "Brute force password guessing"],"Ans": "Login functions should not be abused in an automated way that an attacker could create a\nscript that contains a list of usernames and passwords, which he could use against your\nlogin function in order to gain unauthorized access to user accounts."},
{"Id": 27, "Ques": ["What is Denial of service by locking out accounts ?", "What does Denial of service by locking out accounts mean ?", "Tell me something about Denial of service by locking out accounts ?", "Denial of service by locking out accounts"],"Ans": "Whenever the opportunity to log into the application is offered, it should not lock out accounts. A hacker could abuse this function to make the application deny access towards its power users."},
{"Id": 28, "Ques": ["What is Predictable password and or token generation ?", "What does Predictable password and or token generation mean ?", "Tell me something about Predictable password and or token generation ?", "Predictable password and or token generation"],"Ans": "Tokens or passwords that are used within the application must contain high entropy in\norder to prevent the prediction of these values."},
{"Id": 29, "Ques": ["What is Unauthorized credential changes ?", "What does Unauthorized credential changes mean ?", "Tell me something about Unauthorized credential changes ?", "Unauthorized credential changes"],"Ans": "An application which offers user login functionality, usually has an administration page\nwhere userdata can be modified. When the user wants to change this data he should\nspecify his current password."},
{"Id": 30, "Ques": ["What is Double decoding of headers parameters ?", "What does Double decoding of headers parameters mean ?", "Tell me something about Double decoding of headers parameters ?", "Double decoding of headers parameters"],"Ans": "Double decoding is a problem which often occurs when multiple servers are used in which a\nconfiguration error is made.\nA hacker can encode his payload differently so it will not be recognized by a Web Application Firewall (WAF) or an Intrusion Detection System (IDS) and also bypass the escaping of the application."},
{"Id": 31, "Ques": ["What is Resource identifier injection ?", "What does Resource identifier injection mean ?", "Tell me something about Resource identifier injection ?", "Resource identifier injection"],"Ans": "A resource identifier injection basically means that the attacker can determine which\nresources are loaded into the web application.\nAn attacker could thus influence the operation of the web application and redirect users\nto other websites. This attack consists of changing resource identifiers used by an\napplication in order to perform a malicious task. When an application permits a user\ninput to define a resource, like a file name or port number,\nthis data can be manipulated to execute or access different resources.\nIn order to be properly executed, the attacker must have the possibility to specify a\nresource identifier through the application form and the application must permit the execution.\nThe resource type affected by user input indicates the content type that may be exposed.\nFor example, an application that permits input of special characters like period, slash,\nand backlash is risky when used in methods that interact with the file system.\nThe resource injection attack focuses on accessing other resources than the local\nfilesystem, which is different attack technique known as a Path Manipulation attack."},
{"Id": 32, "Ques": ["What is Dynamic scripting injection ?", "What does Dynamic scripting injection mean ?", "Tell me something about Dynamic scripting injection ?", "Dynamic scripting injection"],"Ans": "When user input is used to evaluate scripting code, highsecurity risks could be introduced. If the input is not properly escaped an attacker can inject his own script code and gain access to the server."},
{"Id": 33, "Ques": ["What is Regular expression injection ?", "What does Regular expression injection mean ?", "Tell me something about Regular expression injection ?", "Regular expression injection"],"Ans": "If the application uses regular expressions which receive user input,\nthen the user input should be properly escaped.\nIf not done properly, then the hacker can affect the regular expression and modify their\nlogic. In some cases, an attacker could even gain access to the server."},
{"Id": 34, "Ques": ["What is Automated spamming via feedback scripts ?", "What does Automated spamming via feedback scripts mean ?", "Tell me something about Automated spamming via feedback scripts ?", "Automated spamming via feedback scripts"],"Ans": "A hacker must not gain the ability to abuse an applications email functionality by\nmeans of scripts which sends automated spamming mails."},
{"Id": 35, "Ques": ["What is Session cookies without the Secure flag ?", "What does Session cookies without the Secure flag mean ?", "Tell me something about Session cookies without the Secure flag ?", "Session cookies without the Secure flag"],"Ans": "The secure flag is an option that can be set when creating a cookie.\nThis flag ensures that the cookie will not be sent over an unencrypted\nconnection by the browser,which ensures that the session cookie can not be sent over a nonencrypted link."},
{"Id": 36, "Ques": ["What is Session cookies without the HttpOnly flag ?", "What does Session cookies without the HttpOnly flag mean ?", "Tell me something about Session cookies without the HttpOnly flag ?", "Session cookies without the HttpOnly flag"],"Ans": "An HttpOnly flag is an option that can be set when creating a cookie. This flag ensures that the cookie cannot be read or edited by JavaScript. This ensures an attacker cannot steal this cookie as a crosssite scripting vulnerability is present in the application."},
{"Id": 37, "Ques": ["What is External session hijacking ?", "What does External session hijacking mean ?", "Tell me something about External session hijacking ?", "External session hijacking"],"Ans": "When an attacker obtains a users session cookie, then he can steal the identity of the\nuser which the session cookie belongs to."},
{"Id": 38, "Ques": ["What is Insecure transmission of session cookies ?", "What does Insecure transmission of session cookies mean ?", "Tell me something about Insecure transmission of session cookies ?", "Insecure transmission of session cookies"],"Ans": "If the session cookies are sent over an unencrypted connection,\nthey should be withdrawn immediately.\nThese cookies are not to be trusted anymore as a hacker may have captured their values."},
{"Id": 39, "Ques": ["What is Unproven cryptographic algorithms ?", "What does Unproven cryptographic algorithms mean ?", "Tell me something about Unproven cryptographic algorithms ?", "Unproven cryptographic algorithms"],"Ans": "The encryption techniques used in the application must be known and proven methods.\nWhen there is a selfmade hashing algorithm developed, it is likely to contain\nvulnerabilities due to mathflaws resulting in encryption which can be broken."},
{"Id": 40, "Ques": ["What is Client side authentication ?", "What does Client side authentication mean ?", "Tell me something about Client side authentication ?", "Client side authentication"],"Ans": "An application could implement authentication functionalities through JavaScript and HTML.\nHowever, these are clientside constraints that are imposed, which means that a hacker\ncan easily disable or modify these constraints."},
{"Id": 41, "Ques": ["What is Identifier based authorization ?", "What does Identifier based authorization mean ?", "Tell me something about Identifier based authorization ?", "Identifier based authorization"],"Ans": "An application uses parameters in order to process data.\nThese parameters can also be used to assign certain roles and retrieve\nContent corresponding with those parameters.\nFor example:"},
{"Id": 42, "Ques": ["What is Principle of complete mediation ?", "What does Principle of complete mediation mean ?", "Tell me something about Principle of complete mediation ?", "Principle of complete mediation"],"Ans": "Throughout development of the application, there must be perpetual checks in place to check\nif all pages and resources by default require authentication except those specifically intended to be public."},
{"Id": 43, "Ques": ["What is Prepared statements and query parameterization ?", "What does Prepared statements and query parameterization mean ?", "Tell me something about Prepared statements and query parameterization ?", "Prepared statements and query parameterization"],"Ans": "All SQL queries, HQL, OSQL, NOSQL and stored procedures, related to stored procedures should be\nprotected by the use of query parameterization.\nIf an attacker can inject malicious code into these queries and gain the ability to\nmanipulate them and can withdraw, update and delete data which is stored on the\ntarget database."},
{"Id": 44, "Ques": ["What is Are all passwords hashed, salted and stretched ?", "What does Are all passwords hashed, salted and stretched mean ?", "Tell me something about Are all passwords hashed, salted and stretched ?", "Are all passwords hashed, salted and stretched"],"Ans": "Verify that account passwords are one way hashed with a salt, and there is sufficient work \nfactor to defeat brute force and password hash recovery attacks."},
{"Id": 45, "Ques": ["What is Sensitive information transmitted by unencrypted methods ?", "What does Sensitive information transmitted by unencrypted methods mean ?", "Tell me something about Sensitive information transmitted by unencrypted methods ?", "Sensitive information transmitted by unencrypted methods"],"Ans": "Whenever sensitive information is sent by unencrypted methods an attacker could intercept\nthis data and use this for malicious intents."},
{"Id": 46, "Ques": ["What is Session information is not stored server side ?", "What does Session information is not stored server side mean ?", "Tell me something about Session information is not stored server side ?", "Session information is not stored server side"],"Ans": "Whenever session information is not stored on the serverside an attacker could easily tamper\nand manipulate these values. This is always a bad idea and you should not do this!"},
{"Id": 47, "Ques": ["What is The crossdomain xml should only contains trusted domains ?", "What does The crossdomain xml should only contains trusted domains mean ?", "Tell me something about The crossdomain xml should only contains trusted domains ?", "The crossdomain xml should only contains trusted domains"],"Ans": "The use of a crossdomain.xml file is required when the web application uses Flash.\nThis file is used to set up restrictions for any other web servers using the\nflash application. If these are not set correctly, an attacker could exploit this to\nexecute targeted attacks against the users of the web application."},
{"Id": 48, "Ques": ["What is Session ids should be generated with sufficient entropy ?", "What does Session ids should be generated with sufficient entropy mean ?", "Tell me something about Session ids should be generated with sufficient entropy ?", "Session ids should be generated with sufficient entropy"],"Ans": "Whenever session IDs are not generated with a sufficient entropy this could lead to a\nsession collision or session hijacking. If an attacker can guess an authenticated user's\nsession identifier, he can take over the user's session."},
{"Id": 49, "Ques": ["What is User generated session ids should be rejected by the server ?", "What does User generated session ids should be rejected by the server mean ?", "Tell me something about User generated session ids should be rejected by the server ?", "User generated session ids should be rejected by the server"],"Ans": "Whenever user generated session IDs are not rejected by the server,\nan attacker could change the session credentials given by the server on the targets\ncomputer into an easy to remember value."},
{"Id": 50, "Ques": ["What is The logout functionality should revoke the complete session ?", "What does The logout functionality should revoke the complete session mean ?", "Tell me something about The logout functionality should revoke the complete session ?", "The logout functionality should revoke the complete session"],"Ans": "When the logout functionality does not revoke the complete session, an attacker could still\nimpersonate a user when he has access to the session cookie even after the user is logged off the application."},
{"Id": 51, "Ques": ["What is The login functionality should always generate a new session id ?", "What does The login functionality should always generate a new session id mean ?", "Tell me something about The login functionality should always generate a new session id ?", "The login functionality should always generate a new session id"],"Ans": "Whenever an user is successfully authenticated the application should generate a\nnew session cookie."},
{"Id": 52, "Ques": ["What is Does The application enforce the use of secure passwords ?", "What does Does The application enforce the use of secure passwords mean ?", "Tell me something about Does The application enforce the use of secure passwords ?", "Does The application enforce the use of secure passwords"],"Ans": "Applications should encourage the use of strong passwords and passphrases. Preferably the\npassword policy should not put limitations or restrictions on the chosen passwords for example\nthe length of a passowrd or passphrase. Whenever the application supports strong passwords and\nthe use of password managers, the possibility for an attacker performing a succesfull bruteforce \nattack drops significantly."},
{"Id": 53, "Ques": ["What is Session IDs do not timeout (idl) ?", "What does Session IDs do not timeout (idl) mean ?", "Tell me something about Session IDs do not timeout (idl) ?", "Session IDs do not timeout (idl)"],"Ans": "All sessions should implement an idle or inactivity timeout.\nThis timeout defines the amount of time a session will remain active in case there is no\nactivity in the session, closing and invalidating the session upon the defined idle period\nsince the last HTTP request received by the web application for a given session ID.\nThe idle timeout limits the chances an attacker has to guess and use a valid session ID\nfrom another user. However, if the attacker is able to hijack a given session,\nthe idle timeout does not limit the attacker's actions, as he can generate activity on\nthe session periodically to keep the session active for longer periods of time."},
{"Id": 54, "Ques": ["What is Directory listing ?", "What does Directory listing mean ?", "Tell me something about Directory listing ?", "Directory listing"],"Ans": "Whenever directory listing is enabled, an attacker could gain sensitive information about\nthe systems hierarchical structure and gain knowledge about directories or files which should\npossibly not be publicly accessible. An attacker could use this information to\nincrease his attack vector. In some cases this could even lead to an attacker gaining knowledge about\ncredentials or old vulnerable system demo functions which might lead to remote code execution."},
{"Id": 55, "Ques": ["What is Unnecessary features enabled or installed ?", "What does Unnecessary features enabled or installed mean ?", "Tell me something about Unnecessary features enabled or installed ?", "Unnecessary features enabled or installed"],"Ans": "Whenever there are unnecessary features enabled or installed this could increase\nthe attack surface of an attacker which could lead to serious danger such as XXE/CMD/XSS injections."},
{"Id": 56, "Ques": ["What is Avoid the use of default and predictable acounts. ?", "What does Avoid the use of default and predictable acounts. mean ?", "Tell me something about Avoid the use of default and predictable acounts. ?", "Avoid the use of default and predictable acounts."],"Ans": "Whenever default or predictable accounts are available on an application/server this could\nlead to an attacker compromising these services. Make sure all default and predictable\naccounts are disabled or deleted from the services."},
{"Id": 57, "Ques": ["What is Security settings in your development frameworks ?", "What does Security settings in your development frameworks mean ?", "Tell me something about Security settings in your development frameworks ?", "Security settings in your development frameworks"],"Ans": "Whenever certain security settings in your application frameworks\n(e.g., Struts, Spring, ASP.NET) and libraries are not set to secure values, this could lead\nto vulnerabilities in your application which an attacker could exploit."},
{"Id": 58, "Ques": ["What is Insecure datastorage ?", "What does Insecure datastorage mean ?", "Tell me something about Insecure datastorage ?", "Insecure datastorage"],"Ans": "Whenever sensitive data is stored cleartext, this data is compromised as soon as it\nfalls into the hands of an attacker."},
{"Id": 59, "Ques": ["What is Authentication based on the knowledge of a secret URL ?", "What does Authentication based on the knowledge of a secret URL mean ?", "Tell me something about Authentication based on the knowledge of a secret URL ?", "Authentication based on the knowledge of a secret URL"],"Ans": "This is a form of security by obscurity. Whenever an attacker manages to fuzz or spider\nthis URL the application could compromise whatever is behind this URL."},
{"Id": 60, "Ques": ["What is Open forward and Open redirects ?", "What does Open forward and Open redirects mean ?", "Tell me something about Open forward and Open redirects ?", "Open forward and Open redirects"],"Ans": "Unvalidated redirects and forwards are possible when a web application accepts untrusted\ninput that could cause the web application to redirect the request to a URL contained\nwithin the untrusted input. By modifying untrusted URL input to a malicious site, an attacker\nmay successfully launch a phishing scam and steal user credentials. Because the server\nname in the modified link is identical to the original site, phishing attempts may have\na more trustworthy appearance. Unvalidated redirect and forward attacks can also be used\nto maliciously craft a URL that would pass the application's access control check and\nthen forward the attacker to privileged functions that they would normally not be able\nto access."},
{"Id": 61, "Ques": ["What is Incorrect or missing charset ?", "What does Incorrect or missing charset mean ?", "Tell me something about Incorrect or missing charset ?", "Incorrect or missing charset"],"Ans": "When the browser has to guess the charset according to the content that is presented by\nthe application, then this could lead to XSS injections when the guess is wrong."},
{"Id": 62, "Ques": ["What is Extraneous files in document root ?", "What does Extraneous files in document root mean ?", "Tell me something about Extraneous files in document root ?", "Extraneous files in document root"],"Ans": "Whenever the document root contains extraneous files, these files could be accessed by an\nattacker or could possibly contain functionality which could contain other vulnerabilities."},
{"Id": 63, "Ques": ["What is Username enumeration ?", "What does Username enumeration mean ?", "Tell me something about Username enumeration ?", "Username enumeration"],"Ans": "Whenever an application generates an error like:"},
{"Id": 64, "Ques": ["What is HTTP header injection ?", "What does HTTP header injection mean ?", "Tell me something about HTTP header injection ?", "HTTP header injection"],"Ans": "HTTP header injection is a general class of web application security vulnerability which\noccurs when Hypertext Transfer Protocol (HTTP) headers are\ndynamically generated based on user input. Header injection in HTTP responses can allow\nfor HTTP response splitting (also known as CRLF, Carriage Return Line Feed),\nSession fixation via the SetCookie header, crosssite scripting (XSS),\nand malicious redirect attacks via the location header. HTTP header injection is a\nrelatively new area for webbased attacks, and has primarily been pioneered\nby Amit Klein in his work on request/response smuggling/splitting.\nVulnerabilities due to HTTP header injections such as CRLF are no longer\nfeasible due to the fact that multiple header requests are not possible."},
{"Id": 65, "Ques": ["What is GET POST requests ?", "What does GET POST requests mean ?", "Tell me something about GET POST requests ?", "GET POST requests"],"Ans": "Authors of services which use the HTTP protocol SHOULD NOT use GETbased forms for the\nsubmission of sensitive data, because this will cause this data to be\nencoded in the RequestURI. Many existing servers, proxies,\nand browsers will log the request URL in some place where it might be\nvisible to third parties. Servers can use POSTbased form submission instead.\nGET parameters are also more likely to be vulnerable to XSS. Please refer to the\nXSS manual in the knowledge base for more information."},
{"Id": 66, "Ques": ["What is Insecure internal communication ?", "What does Insecure internal communication mean ?", "Tell me something about Insecure internal communication ?", "Insecure internal communication"],"Ans": "Whenever organizations communicate by means of unencrypted connections, an attacker\ncould easily sniff insecure communications and access sensitive information."},
{"Id": 67, "Ques": ["What is Sensitive information stored alongside the source code ?", "What does Sensitive information stored alongside the source code mean ?", "Tell me something about Sensitive information stored alongside the source code ?", "Sensitive information stored alongside the source code"],"Ans": "Sometimes when developing an application a programmer stores a password or other\ncredentials into the sourcecode as a comment for other developers to\nlogin into the application. When these comments still exist in a live environment,\nan attacker could use these credentials to gain access to the system."},
{"Id": 68, "Ques": ["What is The possible risks to the application must be documented ?", "What does The possible risks to the application must be documented mean ?", "Tell me something about The possible risks to the application must be documented ?", "The possible risks to the application must be documented"],"Ans": "The information that is stored of the application and/or user\nactivities needs to be documented, this will make it transparent where sensitive\ninformation is stored and why."},
{"Id": 69, "Ques": ["What is Possible attackers of the application must be documented ?", "What does Possible attackers of the application must be documented mean ?", "Tell me something about Possible attackers of the application must be documented ?", "Possible attackers of the application must be documented"],"Ans": "Authentication decisions should be logged along with relevant metadata for security \ninvestigations. This information could for example, be used whenever there is suspicion about\naccounts being compromised. Also, passwords and other sensitive information should never be stored\nin these log files. Whenever an attacker gains knowledge of these files, this information\ncould be used to compromise other accounts. "},
{"Id": 70, "Ques": ["What is Audit logs ?", "What does Audit logs mean ?", "Tell me something about Audit logs ?", "Audit logs"],"Ans": "An audit trail (also called audit log) is a securityrelevant chronological record,\nset of records, and/or destination and source of records that provide documentary\nevidence of the sequence of activities that have affected at any time a specific operation,\nprocedure, or event."},
{"Id": 71, "Ques": ["What is User credentials in audit logs ?", "What does User credentials in audit logs mean ?", "Tell me something about User credentials in audit logs ?", "User credentials in audit logs"],"Ans": "Whenever there are user credentials supplied in an audit log,\nthis could become a risk whenever an attacker could gain access to one of these log files."},
{"Id": 72, "Ques": ["What is Intrusion detecting and reporting ?", "What does Intrusion detecting and reporting mean ?", "Tell me something about Intrusion detecting and reporting ?", "Intrusion detecting and reporting"],"Ans": "All possible attacks on your application should be detected and reported in order to\nprevent further escalation."},
{"Id": 73, "Ques": ["What is Authentication at a central location ?", "What does Authentication at a central location mean ?", "Tell me something about Authentication at a central location ?", "Authentication at a central location"],"Ans": "Authentication should always be performed at a central location in the application, in\norder to prevent missing authentication on certain levels in the application."},
{"Id": 74, "Ques": ["What is IP adresses in internal HTTP headers ?", "What does IP adresses in internal HTTP headers mean ?", "Tell me something about IP adresses in internal HTTP headers ?", "IP adresses in internal HTTP headers"],"Ans": "Whenever IP addresses are used in HTTP headers in internal structures of your organization,\nan attacker could use these to enlarge his attack vector and reconstruct your\ninternal infrastructures."},
{"Id": 75, "Ques": ["What is Authentication enforced by the web sever ?", "What does Authentication enforced by the web sever mean ?", "Tell me something about Authentication enforced by the web sever ?", "Authentication enforced by the web sever"],"Ans": "Authentication should be enforced by the webserver. Whenever these configurations are\nnot enforced on the server, an attacker could gain access to authorized\npages on your application."},
{"Id": 76, "Ques": ["What is The audit log must include a priority system ?", "What does The audit log must include a priority system mean ?", "Tell me something about The audit log must include a priority system ?", "The audit log must include a priority system"],"Ans": "If the audit log does not contain a clear priority system, it will be difficult to\nprioritize different types of process failures."},
{"Id": 77, "Ques": ["What is Servers must not be trusted without explicit authentication ?", "What does Servers must not be trusted without explicit authentication mean ?", "Tell me something about Servers must not be trusted without explicit authentication ?", "Servers must not be trusted without explicit authentication"],"Ans": "Whenever the server your webapplication is connecting towards is not using any form of\nexplicit authentication and is internet facing, then this means the server\ncannot be trusted. This is because the server can be potentially be owned and managed by\neverybody including hackers."},
{"Id": 78, "Ques": ["What is Ensure overall security ?", "What does Ensure overall security mean ?", "Tell me something about Ensure overall security ?", "Ensure overall security"],"Ans": "Some parts of the application at first sight might seem to acquire a higher level of\nsecurity than i.e unauthorized/public parts of the application.\nThis however, is not true since breaching public parts could also lead to an attacker\ncompromising the application or other users accounts."},
{"Id": 79, "Ques": ["What is Re authentication ?", "What does Re authentication mean ?", "Tell me something about Re authentication ?", "Re authentication"],"Ans": "Whenever a user is changing credentials such as his password, the user should always be\nchallenged by the application to reauthenticate himself. This is in order to prevent an\nattacker from changing credentials if ever an attacker could hijack another users session."},
{"Id": 80, "Ques": ["What is No shared knowledge for secret questions ?", "What does No shared knowledge for secret questions mean ?", "Tell me something about No shared knowledge for secret questions ?", "No shared knowledge for secret questions"],"Ans": "Whenever an application ask an user a secret question i.e a password forgot\nfunctionality, these questions should not be shared knowledge an attacker could get from\nthe web to prevent him compromising the account by this function."},
{"Id": 81, "Ques": ["What is Disallow the use of old passwords ?", "What does Disallow the use of old passwords mean ?", "Tell me something about Disallow the use of old passwords ?", "Disallow the use of old passwords"],"Ans": "This is a mitigation of the risk that a password can leak by any means towards a possible attacker. Because of password reuse, this could happen not only due to a leak in your site. Changing the password to a new one minimizes the damage."},
{"Id": 82, "Ques": ["What is Absolute session time out ?", "What does Absolute session time out mean ?", "Tell me something about Absolute session time out ?", "Absolute session time out"],"Ans": "All sessions should implement an absolute timeout, regardless of session activity.\nThis timeout defines the maximum amount of time a session can be active,\nclosing and invalidating the session upon the defined absolute period since the given\nsession was initially created by the web application. After invalidating the session,\nthe user is forced to (re)authenticate again in the web application and establish\na new session. The absolute session limits the amount of time an attacker can use a\nhijacked session and impersonate the victim user."},
{"Id": 83, "Ques": ["What is Logout structuring ?", "What does Logout structuring mean ?", "Tell me something about Logout structuring ?", "Logout structuring"],"Ans": "Placing a logout link on every page that requires authentication helps the user end the\nsession when he is done with the site. Ending the session helps prevent hijacking."},
{"Id": 84, "Ques": ["What is Verify that the session id is never disclosed ?", "What does Verify that the session id is never disclosed mean ?", "Tell me something about Verify that the session id is never disclosed ?", "Verify that the session id is never disclosed"],"Ans": "If the session id is disclosed in the URL the users session ID can be easily obtained by\nan attacker and could leak through the referrer header towards other severs. Also whenever\nthe session ID is disclosed in the URL the possibility also arises to perform other\nattacks like session fixation which could lead to session hijacking."},
{"Id": 85, "Ques": ["What is Session Domain cookies ?", "What does Session Domain cookies mean ?", "Tell me something about Session Domain cookies ?", "Session Domain cookies"],"Ans": "The Domain option allows you to specify whether or not to send the cookie to subdomains."},
{"Id": 86, "Ques": ["What is Access control failure ?", "What does Access control failure mean ?", "Tell me something about Access control failure ?", "Access control failure"],"Ans": "Handling errors securely is a key aspect of secure coding. There are two types of errors\nthat deserve special attention. The first is exceptions that occur in the processing of a\nsecurity control itself. It is important that these exceptions do not enable behavior\nthat the countermeasures would normally not allow. As a developer, you should consider\nthat there are generally three possible outcomes from a security\nmechanism: "},
{"Id": 87, "Ques": ["What is Input rejection ?", "What does Input rejection mean ?", "Tell me something about Input rejection ?", "Input rejection"],"Ans": "Whenever the application detects malicious or unexpected userinput, you want to make sure\nthe application actual rejects the submitted userinput rather than directly process it."},
{"Id": 88, "Ques": ["What is Input validation ?", "What does Input validation mean ?", "Tell me something about Input validation ?", "Input validation"],"Ans": "To ensure that the application is robust against all forms of input data, this data should\nbe sanitized and/or encoded on serverside since an attacker could otherwise easy bypass\nthese checks with an intercepting proxy."},
{"Id": 89, "Ques": ["What is Single input validation controls ?", "What does Single input validation controls mean ?", "Tell me something about Single input validation controls ?", "Single input validation controls"],"Ans": "Input validation refers to the process of validating all the input to an application\nbefore using it. Input validation is absolutely critical to application security,\nand most application risks involve tainted input at some level."},
{"Id": 90, "Ques": ["What is Logging validation failures ?", "What does Logging validation failures mean ?", "Tell me something about Logging validation failures ?", "Logging validation failures"],"Ans": "When you log all the input validation failures in your application you can discover in an\nearly stage that your application is under attack and take quick countermeasures against\nthe attackers."},
{"Id": 91, "Ques": ["What is Logging implemented on the serverside ?", "What does Logging implemented on the serverside mean ?", "Tell me something about Logging implemented on the serverside ?", "Logging implemented on the serverside"],"Ans": "Logging should always be implemented on the serverside since an attacker otherwise \nmanipulates the functionality and erases his traces."},
{"Id": 92, "Ques": ["What is Logging guidelines ?", "What does Logging guidelines mean ?", "Tell me something about Logging guidelines ?", "Logging guidelines"],"Ans": "The logging should contain some guidelines in order to organize your logging file in such\na way it  would allow for a detailed investigation of the timeline when an event happens."},
{"Id": 93, "Ques": ["What is Log viewing software code injection ?", "What does Log viewing software code injection mean ?", "Tell me something about Log viewing software code injection ?", "Log viewing software code injection"],"Ans": "Whenever user supplied input is being handled into log viewing software, this software can be manipulated by potential attackers whenever this input is not properly being sanitized before outputting in the software. Depending on the context of where the supplied input is being used this could lead to an entire subset of attacks."},
{"Id": 94, "Ques": ["What is CA certificates ?", "What does CA certificates mean ?", "Tell me something about CA certificates ?", "CA certificates"],"Ans": "In cryptography, a certificate authority or certification authority (CA) is an entity that\nissues digital certificates. A digital certificate certifies the ownership of a public key\nby the named subject of the certificate. Sometimes it happens that a CA goes bad and is\nrevoked from the browser. This will lead to untrusted TLS connections if your application\nuses an issued certificate from this CA."},
{"Id": 95, "Ques": ["What is All connections should be TLS ?", "What does All connections should be TLS mean ?", "Tell me something about All connections should be TLS ?", "All connections should be TLS"],"Ans": "Whenever an application provides TLS, all connections should be TLS otherwise the\nencryption will be lost."},
{"Id": 96, "Ques": ["What is Log TLS connection failures ?", "What does Log TLS connection failures mean ?", "Tell me something about Log TLS connection failures ?", "Log TLS connection failures"],"Ans": "Failing TLS connections should always be logged. This is a great indicator that 'something' is wrong."},
{"Id": 97, "Ques": ["What is Content type headers ?", "What does Content type headers mean ?", "Tell me something about Content type headers ?", "Content type headers"],"Ans": "Setting the right content headers is important for hardening your applications security,\nthis reduces exposure to driveby download attacks or sites serving user uploaded\ncontent that, by clever naming could be treated by MS Internet Explorer as executable or\ndynamic HTML files and thus can lead to security vulnerabilities."},
{"Id": 98, "Ques": ["What is Malicious intent ?", "What does Malicious intent mean ?", "Tell me something about Malicious intent ?", "Malicious intent"],"Ans": "Before pushing a code live you should check the software for malicious code in order to\nmake sure no developers with evil intent made backdoors or deliberately put in exploits."},
{"Id": 99, "Ques": ["What is Sandboxing ?", "What does Sandboxing mean ?", "Tell me something about Sandboxing ?", "Sandboxing"],"Ans": "A sandbox is a security mechanism for separating running programs.\nIt is often used to execute untested code, or untrusted programs from\nunverified third parties, suppliers, untrusted users and untrusted websites. It's creating\nan extra layer of security where an attacker first needs to break out from."},
{"Id": 100, "Ques": ["What is Repudiation attack ?", "What does Repudiation attack mean ?", "Tell me something about Repudiation attack ?", "Repudiation attack"],"Ans": "A repudiation attack happens when an application or system does not adopt controls to\nproperly track and log users actions, thus permitting malicious manipulation or forging\nthe identification of new actions. This attack can be used to change the authoring\ninformation of actions executed by a malicious user in order to log wrong data to log files.\nIts usage can be extended to general data manipulation in the name of others,\nin a similar manner as spoofing mail messages. If this attack takes place, the data stored\nin log files can be considered invalid or misleading."},
{"Id": 101, "Ques": ["What is Server side validation ?", "What does Server side validation mean ?", "Tell me something about Server side validation ?", "Server side validation"],"Ans": "Validation of user supplied input must always be enforced on the server side.\nWhenever validation of the input is being perfomed on the client side then\nthe constraints can easilly be bypassed whenever an attacker uses an intercepting proxy\nwhich he can use to tamper data after they have been validated and send to the server. "},
{"Id": 102, "Ques": ["What is Privilege escalation ?", "What does Privilege escalation mean ?", "Tell me something about Privilege escalation ?", "Privilege escalation"],"Ans": "Attackers with low access rights wil always try to elevate their privileges in order to get more sensitive information/functionalities at their disposal. This can be achieved by for example:"},
{"Id": 103, "Ques": ["What is Enforce sequential step order ?", "What does Enforce sequential step order mean ?", "Tell me something about Enforce sequential step order ?", "Enforce sequential step order"],"Ans": "Whenever a functionality consists out of following several steps to achieve some goal i.e,"},
{"Id": 104, "Ques": ["What is step up or adaptive authentication ?", "What does step up or adaptive authentication mean ?", "Tell me something about step up or adaptive authentication ?", "step up or adaptive authentication"],"Ans": "Whenever a user browses a section of a webbased application that contains sensitive information the user should be challenged authenticate again using a higher assurance credential to be granted access to this information.\nThis is to prevent attackers from reading sensitive information after they successfully hijacked a user account."},
{"Id": 105, "Ques": ["What is Cross origin resource sharing ?", "What does Cross origin resource sharing mean ?", "Tell me something about Cross origin resource sharing ?", "Cross origin resource sharing"],"Ans": "Cross Origin Resource Sharing or CORS is a mechanism that enables a web browser to perform\n'crossdomain' requests using the XMLHttpRequest L2 API in a controlled manner.\nIn the past, the XMLHttpRequest L1 API only allowed requests to be sent within the same\norigin as it was restricted by the same origin policy."},
{"Id": 106, "Ques": ["What is Prevent password pre filling ?", "What does Prevent password pre filling mean ?", "Tell me something about Prevent password pre filling ?", "Prevent password pre filling"],"Ans": "Passwords should never be stored plaintext or in a reversible format on the application. Whenever an attacker hacks \ninto the applications SQL database the passwords are directly compromised. In the case of\nprefilled forms in the application, an attacker could also hijack the credentials by badly\nconfigured CORS rules or XSS attacks."},
{"Id": 107, "Ques": ["What is All authentication controls must fail securely ?", "What does All authentication controls must fail securely mean ?", "Tell me something about All authentication controls must fail securely ?", "All authentication controls must fail securely"],"Ans": "Handling errors securely is a key aspect of secure coding.\nThere are two types of errors that deserve special attention. The first is exceptions\nthat occur in the processing of a security control itself. It's important that these\nexceptions do not enable behavior that the countermeasure would normally not allow.\nAs a developer, you should consider that there are generally three possible outcomes\nfrom a security mechanism:"},
{"Id": 108, "Ques": ["What is Forget password functions ?", "What does Forget password functions mean ?", "Tell me something about Forget password functions ?", "Forget password functions"],"Ans": "Whenever the application provides a password forget functionality or another \ntype of recovery methods there are several implementations of hardened proven ways to make\nthe user recover his password."},
{"Id": 109, "Ques": ["What is Aggregate access control protection ?", "What does Aggregate access control protection mean ?", "Tell me something about Aggregate access control protection ?", "Aggregate access control protection"],"Ans": "Verify the system can protect against aggregation or continuous access of\nsecured functions, resources, or data. For example, possibly by the use of a\nresource governor to limit the number of edits per hour or to prevent the entire database\nfrom being scraped by an individual user."},
{"Id": 110, "Ques": ["What is Canonicalized user input ?", "What does Canonicalized user input mean ?", "Tell me something about Canonicalized user input ?", "Canonicalized user input"],"Ans": "Whenever userinput is partially validated there is a high probability that the application\nmisses a malicious input which could execute a successful attack on your application."},
{"Id": 111, "Ques": ["What is Approved random number generator ?", "What does Approved random number generator mean ?", "Tell me something about Approved random number generator ?", "Approved random number generator"],"Ans": "The lack of entropy available for, or used by, a pseudorandom number generator can be a\nstability and security threat."},
{"Id": 112, "Ques": ["What is Validated cryptographic modules ?", "What does Validated cryptographic modules mean ?", "Tell me something about Validated cryptographic modules ?", "Validated cryptographic modules"],"Ans": "The National Institute of Standards and Technology (NIST) issued the FIPS 140 Publication\nSeries to coordinate the requirements and standards for cryptography modules that include\nboth hardware and software components. Protection of a cryptographic module within a\nsecurity system is necessary to maintain the confidentiality and integrity of the\ninformation protected by the module."},
{"Id": 113, "Ques": ["What is Policy for managing cryptographic keys ?", "What does Policy for managing cryptographic keys mean ?", "Tell me something about Policy for managing cryptographic keys ?", "Policy for managing cryptographic keys"],"Ans": "When there is no policy for managing your cryptographic keys, expired or revoked keys\nthat could unknowingly be used again thus becoming a threat for your encrypted data."},
{"Id": 114, "Ques": ["What is HTTPS and weakly or unencrypted links ?", "What does HTTPS and weakly or unencrypted links mean ?", "Tell me something about HTTPS and weakly or unencrypted links ?", "HTTPS and weakly or unencrypted links"],"Ans": "Imagine the scenario where you have a login form and an application which supports HTTPS.\nWhenever the initial connection (login.php) is not HTTPS and after login (loggedin.php)\nwill be HTTPS the username and password will not be sent through an encrypted manner thus\ncould be easily compromised by attackers. This principle also applies to sending\nvulnerable data towards other unencrypted/weak encrypted links in your application."},
{"Id": 115, "Ques": ["What is Error handling on trusted devices ?", "What does Error handling on trusted devices mean ?", "Tell me something about Error handling on trusted devices ?", "Error handling on trusted devices"],"Ans": "Whenever error handling is not applied through trusted devices the errors it supplies can\nnot be trusted since they can be tampered with."},
{"Id": 116, "Ques": ["What is Single application level logging ?", "What does Single application level logging mean ?", "Tell me something about Single application level logging ?", "Single application level logging"],"Ans": "Whenever the application contains a single applicationlevel logging implementation it\nbecomes clear, transparent and easy to maintain. It also reduces the possibility that you\noverlook high priority logging."},
{"Id": 117, "Ques": ["What is Aggregate user requests ?", "What does Aggregate user requests mean ?", "Tell me something about Aggregate user requests ?", "Aggregate user requests"],"Ans": "Verify the system can protect against aggregation or continuous access to functions,  \nresources, or data. For example, possibly by the use of a resource governor to limit the\nnumber of edits per minute in order to to prevent an automatic attack"},
{"Id": 118, "Ques": ["What is Principle of least privilege ?", "What does Principle of least privilege mean ?", "Tell me something about Principle of least privilege ?", "Principle of least privilege"],"Ans": "The principle of least privilege recommends that accounts have the least amount of\nprivilege required to perform their business processes. This encompasses user rights,\nresource permissions such as CPU limits, memory, network, and file system permissions."},
{"Id": 119, "Ques": ["What is TLS implementation must operate in an approved mode of operation ?", "What does TLS implementation must operate in an approved mode of operation mean ?", "Tell me something about TLS implementation must operate in an approved mode of operation ?", "TLS implementation must operate in an approved mode of operation"],"Ans": "To enforce the maximum amount of security out of the TLS implementation it should always\nsuffice the approved mode of operation."},
{"Id": 120, "Ques": ["What is Character encoding ?", "What does Character encoding mean ?", "Tell me something about Character encoding ?", "Character encoding"],"Ans": "Character encoding is the process of mapping characters, numbers and other symbols to a\nstandard format. Typically, this is done to create a message ready for transmission\nbetween sender and receiver. It is, in simple terms, the conversion of characters\n(belonging to different languages like English, Chinese, Greek or any other known language)\ninto bytes. An example of a widely used character encoding scheme is the American\nStandard Code for Information Interchange (ASCII) that initially used 7bit codes.\nMore recent examples of encoding schemes would be the Unicode UTF8 and UTF16 computing\nindustry standards. In the space of application security and due to the plethora of\nencoding schemes available, character encoding has a popular misuse. It is being used for\nencoding malicious injection strings in a way that obfuscates them. This can lead to the\nbypass of input validation filters, or take advantage of particular ways in which browsers\nrender encoded text."},
{"Id": 121, "Ques": ["What is HTTP request methods ?", "What does HTTP request methods mean ?", "Tell me something about HTTP request methods ?", "HTTP request methods"],"Ans": "HTTP offers a number of methods that can be used to perform actions on the web server.\nMany of these methods are designed to aid developers in deploying and testing\nHTTP applications. These HTTP methods can be used for nefarious purposes if the web\nserver is misconfigured."},
{"Id": 122, "Ques": ["What is Verbose version information ?", "What does Verbose version information mean ?", "Tell me something about Verbose version information ?", "Verbose version information"],"Ans": "Revealing system data or debugging information helps an adversary learn about the system\nand form a plan of attack. An information leak occurs when system data or debugging\ninformation leaves the program through an output stream or logging function."},
{"Id": 123, "Ques": ["What is HTTP headers added by a frontend ?", "What does HTTP headers added by a frontend mean ?", "Tell me something about HTTP headers added by a frontend ?", "HTTP headers added by a frontend"],"Ans": "There are some kind of headers that uses tokens such as Bearer or JWT which are signed or calculated using a key, by the server that creates it."},
{"Id": 124, "Ques": ["What is Session management control ?", "What does Session management control mean ?", "Tell me something about Session management control ?", "Session management control"],"Ans": "The ability to restrict and maintain user actions within unique sessions is critical to\nweb security. Most users of this guide will be using an application framework with built\nin session management capabilities. Others will use languages such as Perl CGI that do not.\nThose without a built in session management system and those who override the existing\nsession management systems are at an immediate disadvantage. Implementations built from\nscratch are often weak and breakable. Developers are strongly discouraged from\nimplementing their own Session Management."},
{"Id": 125, "Ques": ["What is Available log analysis tools ?", "What does Available log analysis tools mean ?", "Tell me something about Available log analysis tools ?", "Available log analysis tools"],"Ans": "With a log analysis tool in place, you can easily and quickly do forensics as soon as you\nnotice your application is under attack by attackers and block them out."},
{"Id": 126, "Ques": ["What is Distinguish log ?", "What does Distinguish log mean ?", "Tell me something about Distinguish log ?", "Distinguish log"],"Ans": "Whenever log fields are distinguished from each other by means of logs from trusted and\nuntrusted log fields in your log entries your logs become clearer and more transparent."},
{"Id": 127, "Ques": ["What is sanitise sensitive data rapidly from memory ?", "What does sanitise sensitive data rapidly from memory mean ?", "Tell me something about sanitise sensitive data rapidly from memory ?", "sanitise sensitive data rapidly from memory"],"Ans": "Whenever sensitive data is rapidly removed from the systems’ memory, this decreases the possibility the attacker has to compromise this data by means of memory dumping attacks."},
{"Id": 128, "Ques": ["What is logging is performed before executing the transaction ?", "What does logging is performed before executing the transaction mean ?", "Tell me something about logging is performed before executing the transaction ?", "logging is performed before executing the transaction"],"Ans": "Whenever the logging is performed before executing a transaction you can be ensured that\nthe transactions are logged. This increases the integrity of your log files.\nIf logging is performed after executing a transaction and an attacker does a succcessful attack, then the logging part may not be reached and no trace would be recorded for the attack."},
{"Id": 129, "Ques": ["What is Verify integrity using checksums ?", "What does Verify integrity using checksums mean ?", "Tell me something about Verify integrity using checksums ?", "Verify integrity using checksums"],"Ans": "Always use checksums when working with interpreted code, libraries, executables,\nand configuration files, when these checksums do not match you can determine that\nthese files are corrupted or backdoored."},
{"Id": 130, "Ques": ["What is Deny access from remote resources or systems ?", "What does Deny access from remote resources or systems mean ?", "Tell me something about Deny access from remote resources or systems ?", "Deny access from remote resources or systems"],"Ans": "You should always fend off remote connections with untrusted systems/resources which try to\nconnect to your application in order to prevent connecting to malicious systems that try\nto attack your application."},
{"Id": 131, "Ques": ["What is Certificate paths revocation information ?", "What does Certificate paths revocation information mean ?", "Tell me something about Certificate paths revocation information ?", "Certificate paths revocation information"],"Ans": "Whenever your certificate authority is not trusted anymore you should always be able to\nrecall these certificates ASAP to prevent man in the middle attacks on your applications users."},
{"Id": 132, "Ques": ["What is HTML Caching and client side caching ?", "What does HTML Caching and client side caching mean ?", "Tell me something about HTML Caching and client side caching ?", "HTML Caching and client side caching"],"Ans": "Developers creating HTML5 applications can create fully offlineaware applications using\nthe HTML5 ApplicationCache interface. The Application Cache uses a cache manifest file to\nspecify which files in an HTML5 application can be used offline, and which files require a\nnetwork connection."},
{"Id": 133, "Ques": ["What is Cryptographic modules should operate in their approved mode according to their published security policies ?", "What does Cryptographic modules should operate in their approved mode according to their published security policies mean ?", "Tell me something about Cryptographic modules should operate in their approved mode according to their published security policies ?", "Cryptographic modules should operate in their approved mode according to their published security policies"],"Ans": "Whenever cryptographic modules do not operate in their approved mode according to their\npublished security policies these methods could become weak and become inadequate to\nensure strong ciphers."},
{"Id": 134, "Ques": ["What is Sending data parameters to untrusted devices ?", "What does Sending data parameters to untrusted devices mean ?", "Tell me something about Sending data parameters to untrusted devices ?", "Sending data parameters to untrusted devices"],"Ans": "Whenever an application sends data/parameters to untrusted devices this data could be\ncompromised if the device has malicious intents."},
{"Id": 135, "Ques": ["What is Proces high value business logic flows in a trusted environment ?", "What does Proces high value business logic flows in a trusted environment mean ?", "Tell me something about Proces high value business logic flows in a trusted environment ?", "Proces high value business logic flows in a trusted environment"],"Ans": "Whenever highvalue business logic flows are processed in a trusted monitored environment\nit reduces the movability of an attacker and chances of succeeding to\nperform successful attacks. If an attacker should breach your application his actions\ncould be rapidly followed and countermeasures could be taken."},
{"Id": 136, "Ques": ["What is Data from untrusted sources ?", "What does Data from untrusted sources mean ?", "Tell me something about Data from untrusted sources ?", "Data from untrusted sources"],"Ans": "Whenever data from untrusted servers is executed by your application there is a high\nprobability this data could be contaminated with malicious code. Such as for example\nXSS from JSON files, or XXE when parsing XML files."},
{"Id": 137, "Ques": ["What is User restriction for sensitive data ?", "What does User restriction for sensitive data mean ?", "Tell me something about User restriction for sensitive data ?", "User restriction for sensitive data"],"Ans": "Always enforce multiple layers of security whenever you want to protect sensitive data/files\non your application. If one layer should fail the other layers should prevent the attackers\nfrom succeeding."},
{"Id": 138, "Ques": ["What is Runtime environment ?", "What does Runtime environment mean ?", "Tell me something about Runtime environment ?", "Runtime environment"],"Ans": "Whenever you use runtime environments you want to make sure these are not susceptible for\nbuffer overflows since this could lead to compromise of your application."},
{"Id": 139, "Ques": ["What is Automatic parameter binding ?", "What does Automatic parameter binding mean ?", "Tell me something about Automatic parameter binding ?", "Automatic parameter binding"],"Ans": "If the application framework allows automatic mass parameter assignment\n(also called automatic variable binding) from the inbound request to a model,\nverify that security sensitive fields such as 'accountBalance', 'role' or 'password'\nare protected from malicious automatic binding. Whenever your application takes parameters\nin HTTPs GET statement and passes them as variables to code within the application this\ncould become a safety hazard since the application processes these variables\nin his operations."},
{"Id": 140, "Ques": ["What is cryptographic function implementation ?", "What does cryptographic function implementation mean ?", "Tell me something about cryptographic function implementation ?", "cryptographic function implementation"],"Ans": "Whenever a cryptographic function is not implemented on the server side then these\ncryptographic functions could easily be bypassed by an attacker."},
{"Id": 141, "Ques": ["What is cryptographic modules must fail securely ?", "What does cryptographic modules must fail securely mean ?", "Tell me something about cryptographic modules must fail securely ?", "cryptographic modules must fail securely"],"Ans": "Whenever a cryptographic module does not fail securely this the device needs to be put in\nerror state so it's not useable anymore."},
{"Id": 142, "Ques": ["What is Access to any master secret must be protected from unauthorized access ?", "What does Access to any master secret must be protected from unauthorized access mean ?", "Tell me something about Access to any master secret must be protected from unauthorized access ?", "Access to any master secret must be protected from unauthorized access"],"Ans": "Access to any master secret must be protected from unauthorized access in order to protect\nthe integrity and the confidentiality of the data."},
{"Id": 143, "Ques": ["What is Enforce policys for sensitive data processing ?", "What does Enforce policys for sensitive data processing mean ?", "Tell me something about Enforce policys for sensitive data processing ?", "Enforce policys for sensitive data processing"],"Ans": "When you process data you should always enforce policies for the transfer of sensitive data in order to enforce a higher level of security imposing structured thresholds to fend off attackers."},
{"Id": 144, "Ques": ["What is Access control pattern ?", "What does Access control pattern mean ?", "Tell me something about Access control pattern ?", "Access control pattern"],"Ans": "For successful access control/login functionality there are a lot of things to take into\nconsideration before you start developing this type of functionality."},
{"Id": 145, "Ques": ["What is Password forget pattern ?", "What does Password forget pattern mean ?", "Tell me something about Password forget pattern ?", "Password forget pattern"],"Ans": "Whenever you are implementing a forgot password function into your system there are\na few things you need to take into consideration in order to prevent security flaws\nin your application."},
{"Id": 146, "Ques": ["What is Sessions pattern ?", "What does Sessions pattern mean ?", "Tell me something about Sessions pattern ?", "Sessions pattern"],"Ans": "When working with sessions there are a couple of things you need to consider in order to implement them securely throughout your system. For more detailed information about these items you should check the knowledgebase about:\n1.\tSession management control\n2.\tSession cookies without the Secure flag\n3.\tSession cookies without the HTTP Only flag\n4.\tExternal session hijacking\n5.\tInsecure transmission of session cookies\n6.\tSession information is not stored server side\n7.\tSession ids should be generated with sufficient entropy, the preferred method is the frameworks default session management control implementation is used by the application\n8.\tUser generated session ids should be rejected by the server\n9.\tThe logout functionality should revoke the complete session\n10.\tThe login functionality should always generate (and use) a new session id\n11.\tSession IDs do not timeout.(idle)\n12.\tAbsolute session timed out\n13.\tVerify that the session id is never disclosed\n14.\tSession cookies (Domain)"},
{"Id": 147, "Ques": ["What is Submit forms pattern ?", "What does Submit forms pattern mean ?", "Tell me something about Submit forms pattern ?", "Submit forms pattern"],"Ans": "Whenever a user can submit a form in your system you should consider implementing\nthe following defense mechanism in order to ensure highlevel security."},
{"Id": 148, "Ques": ["What is SQL injection Column truncation ?", "What does SQL injection Column truncation mean ?", "Tell me something about SQL injection Column truncation ?", "SQL injection Column truncation"],"Ans": "Whenever an applications structural logic mismatches with the database structural logic an attacker gains the opportunity to truncate his submit towards your database column by submitting a value longer than the limit allowed in the database.\nImagine you have a system where users can register themselves."},
{"Id": 149, "Ques": ["What is User registration pattern ?", "What does User registration pattern mean ?", "Tell me something about User registration pattern ?", "User registration pattern"],"Ans": "Whenever you allow users to register on your system there are a couple of things you need\nto take into consideration in order to enforce a high level of security\nFor more detailed information about these items you should check the knowledgebase about:"},
{"Id": 150, "Ques": ["What is cross subdomain cookie attack ?", "What does cross subdomain cookie attack mean ?", "Tell me something about cross subdomain cookie attack ?", "cross subdomain cookie attack"],"Ans": "A quick overview of how it works:"},
{"Id": 151, "Ques": ["What is HTML injections ?", "What does HTML injections mean ?", "Tell me something about HTML injections ?", "HTML injections"],"Ans": "Whenever an attacker can inject HTML in your application there is a variety of different\nattacks he could perform such as:"},
{"Id": 152, "Ques": ["What is RFD and file download injections ?", "What does RFD and file download injections mean ?", "Tell me something about RFD and file download injections ?", "RFD and file download injections"],"Ans": "Reflective file download occurs whenever an attacker can \"forge\" a download through misconfiguration in your \"disposition\" and \"content type\" headers. Instead of having the attacker to upload an evil file to the web server he can now force the browser to download a malicious file by abusing these headers and setting the file extension to any type he wants."},
{"Id": 153, "Ques": ["What is identify all application components ?", "What does identify all application components mean ?", "Tell me something about identify all application components ?", "identify all application components"],"Ans": "When you are building an application you first want to map where you are placing\nsource files, libraries and executables."},
{"Id": 154, "Ques": ["What is Identify external dependencies ?", "What does Identify external dependencies mean ?", "Tell me something about Identify external dependencies ?", "Identify external dependencies"],"Ans": "Sometimes your application has certain external dependencies which may strongly\ninfluence your application's operation. These external dependencies\nmight become an attackers target since compromising that service might lead to\na DoS of your system or influence the system in such a way it leaves room for other\nattacks."},
{"Id": 155, "Ques": ["What is High level architecture should be defined ?", "What does High level architecture should be defined mean ?", "Tell me something about High level architecture should be defined ?", "High level architecture should be defined"],"Ans": "Whenever you are developing an application you want to map all the architecture it contains. Whenever there are breaches, updates, or other escalations it makes it easy and transparent for forensics, operators, and developers to do their job as fast as possible."},
{"Id": 156, "Ques": ["What is Threat modeling ?", "What does Threat modeling mean ?", "Tell me something about Threat modeling ?", "Threat modeling"],"Ans": "Threat modeling is a procedure for optimizing Network/ Application/ Internet Security by\nidentifying objectives and vulnerabilities, and then defining countermeasures to prevent,\nor mitigate the effects of, threats to the system. A threat is a potential or actual\nundesirable event that may be malicious (such as DoS attack) or incidental\n(failure of a Storage Device). Threat modeling is a planned activity for identifying and\nassessing application threats and vulnerabilities."},
{"Id": 157, "Ques": ["What is Differential analysis attack ?", "What does Differential analysis attack mean ?", "Tell me something about Differential analysis attack ?", "Differential analysis attack"],"Ans": "Whenever an attacker sends a request to the server, an example by means of\nauthentication functionality. He can measure the average response time between a request\ncontaining a valid username and a request containing a invalid username. The\nattacker can now use this differential in response time to enumerate user accounts."},
{"Id": 158, "Ques": ["What is Client side input validation ?", "What does Client side input validation mean ?", "Tell me something about Client side input validation ?", "Client side input validation"],"Ans": "As web applications become more advanced, an increasing amount of HTML is generated by\nJavaScript on the clientside rather than by the server. Anytime content needs to be\nchanged without refreshing the entire page, the update must be performed using JavaScript.\nMost notably, this is the case when a page is updated after an AJAX request."},
{"Id": 159, "Ques": ["What is Positive validation model ?", "What does Positive validation model mean ?", "Tell me something about Positive validation model ?", "Positive validation model"],"Ans": "There are two popular methods for handling input validation. The first is blacklisting and the second one is the whitelisting method, also known as a positive validation model.\nThe big disadvantage of the blacklisting model would be that an attacker has a great diversity into forging his attack strings and payloads which can make it hard for your application to detect all of them. It would be very time consuming importing them all into your system.\nWhenever you are using a positive validation model you are simply checking for the input you were expecting as defined in your application’s operation, for example:"},
{"Id": 160, "Ques": ["What is TLS certificate public key pinning ?", "What does TLS certificate public key pinning mean ?", "Tell me something about TLS certificate public key pinning ?", "TLS certificate public key pinning"],"Ans": "Pinning is the process of associating a host with their expected X509 certificate or\npublic key. Once a certificate or public key is known or seen for a host, the certificate\nor public key is associated or 'pinned' to the host. If more than one certificate or\npublic key is acceptable, then the program holds a pinset\n(taking from Jon Larimer and Kenny Root Google I/O talk). In this case, the advertised\nidentity must match one of the elements in the pinset."},
{"Id": 161, "Ques": ["What is HSTS preload ?", "What does HSTS preload mean ?", "Tell me something about HSTS preload ?", "HSTS preload"],"Ans": "HTTP StrictTransportSecurity (HSTS) allows sites to specify that they should be accessed\nvia a secure connection only. The problem is, a user's first request to a site employing\nHSTS may not be over HTTPS. A preload list will allow us to ship Firefox with some\npreset HSTS sites that, from the first time they're accessed in the browser, will require\na secure connection."},
{"Id": 162, "Ques": ["What is Forward secrecy ciphers ?", "What does Forward secrecy ciphers mean ?", "Tell me something about Forward secrecy ciphers ?", "Forward secrecy ciphers"],"Ans": "In cryptography, forward secrecy (FS; also known as perfect forward secrecy, or PFS) is a property of keyagreement protocols ensuring that a session key derived from a set of longterm keys cannot be compromised if one of the longterm keys is compromised in the future. The key used to protect the transmission of data must not be used to derive any additional keys, and if the key used to protect the transmission of data is derived from some other keying material, then that material must not be used to derive any more keys. In this way, compromise of a single key permits access only to data protected by that single key."},
{"Id": 163, "Ques": ["What is OCSP stapling ?", "What does OCSP stapling mean ?", "Tell me something about OCSP stapling ?", "OCSP stapling"],"Ans": "OCSP stapling, formally known as the TLS Certificate Status Request extension, is an\nalternative approach to the Online Certificate Status Protocol (OCSP) for checking the\nrevocation status of X.509 digital certificates. It allows the presenter of a\ncertificate to bear the resource cost involved in providing OCSP responses by appending\n(\"stapling\") a timestamped OCSP response signed by the CA to the initial TLS Handshake,\neliminating the need for clients to contact the CA"},
{"Id": 164, "Ques": ["What is STRIDE ?", "What does STRIDE mean ?", "Tell me something about STRIDE ?", "STRIDE"],"Ans": "STRIDE is a collective for a series of vulnerabilities your applications should\ncover in order to harden your applications security."},
{"Id": 165, "Ques": ["What is File inclusion attack ?", "What does File inclusion attack mean ?", "Tell me something about File inclusion attack ?", "File inclusion attack"],"Ans": "The File Inclusion vulnerability allows an attacker to include a file, usually exploiting\na \"dynamic file inclusion\" mechanisms implemented in the target application.\nThe vulnerability occurs due to the use of usersupplied input without proper validation."},
{"Id": 166, "Ques": ["What is Access management ?", "What does Access management mean ?", "Tell me something about Access management ?", "Access management"],"Ans": "Whenever your application contains administration and management functions you should\nput on restrictions for visiting these functionalities in order to reduce an attackers\nattack vector on your services since they are not directly accessible for them."},
{"Id": 167, "Ques": ["What is JSON XML schema ?", "What does JSON XML schema mean ?", "Tell me something about JSON XML schema ?", "JSON XML schema"],"Ans": "When adding schema's to your JSON or XML files you have better control over what type of userinput can be supplied in your application. This dramatically decreases an attacker’s vector when implemented the right way. Nonetheless, you should always apply your own input validation and rejection as an extra layer of defense. This approach is also desirable since you also want to do countering and logging on the user’s requests and input.\t "},
{"Id": 168, "Ques": ["What is Limiting user input size ?", "What does Limiting user input size mean ?", "Tell me something about Limiting user input size ?", "Limiting user input size"],"Ans": "Whenever there is userinput supplied into your application you also want to limit\nthe size of the userinput to appropriate maximum lengths."},
{"Id": 169, "Ques": ["What is Parsing data  exchange formats ?", "What does Parsing data  exchange formats mean ?", "Tell me something about Parsing data  exchange formats ?", "Parsing data  exchange formats"],"Ans": "Whenever you are parsing data exchange formats such as XML, JSON, CSV, etc, you\nhave to make sure that whenever these data files contain malicious code this will not be\nexecuted by your application. You should also not solely depend on your parser to do all\nthe encoding and escaping for you since there could always be an edge case that does\nexecute certain attacks."},
{"Id": 170, "Ques": ["What is Content security policy headers ?", "What does Content security policy headers mean ?", "Tell me something about Content security policy headers ?", "Content security policy headers"],"Ans": "The main use of the content security policy header is to, detect, report, and reject XSS attacks. The core issue in relation to XSS attacks is the browser's inability to distinguish between a script that's intended to be part of your application, and a script that's been maliciously injected by a thirdparty.\nWith the use of CSP(Content Security policy), we can tell the browser which script is safe to execute and which scripts are most likely been injected by an attacker."},
{"Id": 171, "Ques": ["What is Safe javascript jquery methods ?", "What does Safe javascript jquery methods mean ?", "Tell me something about Safe javascript jquery methods ?", "Safe javascript jquery methods"],"Ans": "Whenever you are supplying your JavaScript/jquery with data which is controlled by the\nuser, you should make sure this data is not supplied towards functions which could\ninterpreted the supplied and parse input as code. This could lead to XSS and other code\ninjections."},
{"Id": 172, "Ques": ["What is WYSIWYG editors ?", "What does WYSIWYG editors mean ?", "Tell me something about WYSIWYG editors ?", "WYSIWYG editors"],"Ans": "WYSIWYG editors can be a great risk to your web application since it allows direct\nHTML as input to make the user perform styling on their submissions. This is why the\neditor should be put under a strict sanitation protocol to prevent injections."},
{"Id": 173, "Ques": ["What is Parsing JSON with Javascript ?", "What does Parsing JSON with Javascript mean ?", "Tell me something about Parsing JSON with Javascript ?", "Parsing JSON with Javascript"],"Ans": "The eval() function evaluates or executes an argument."},
{"Id": 174, "Ques": ["What is Account lockout ?", "What does Account lockout mean ?", "Tell me something about Account lockout ?", "Account lockout"],"Ans": "All applications should contain the possibility to lock down accounts for whenever it\ndetects attacks by/on users. Also you should include options for both soft and hard\nlockout mechanisms."},
{"Id": 175, "Ques": ["What is XML attacks ?", "What does XML attacks mean ?", "Tell me something about XML attacks ?", "XML attacks"],"Ans": "Whenever you are using XML in your application there are a few possibilities for\ninjections depending on how you are applying XML in your system."},
{"Id": 176, "Ques": ["What is centralized security controls ?", "What does centralized security controls mean ?", "Tell me something about centralized security controls ?", "centralized security controls"],"Ans": "Whenever security controls do not have a centralized implementation there is a high\nprobability for bugs or security issues being hidden into your application due to the loss\nof abstraction and duplication."},
{"Id": 177, "Ques": ["What is data controller display layer separation ?", "What does data controller display layer separation mean ?", "Tell me something about data controller display layer separation ?", "data controller display layer separation"],"Ans": "The application should separate data, controller, and display layers in order to make your\napplication more clear and understandable in terms of abstraction due to separation."},
{"Id": 178, "Ques": ["What is proven authentication mechanisms ?", "What does proven authentication mechanisms mean ?", "Tell me something about proven authentication mechanisms ?", "proven authentication mechanisms"],"Ans": "Whenever your application has the option for users to authenticate themselves\nyour method should be \"proven\" and secure in the sense of that:"},
{"Id": 179, "Ques": ["What is administrative interfaces must not be accessible to untrusted parties ?", "What does administrative interfaces must not be accessible to untrusted parties mean ?", "Tell me something about administrative interfaces must not be accessible to untrusted parties ?", "administrative interfaces must not be accessible to untrusted parties"],"Ans": "\n Description:"},
{"Id": 180, "Ques": ["What is concurrent session handling ?", "What does concurrent session handling mean ?", "Tell me something about concurrent session handling ?", "concurrent session handling"],"Ans": "You should limit and keep track of all the different active concurrent sessions.\nWhenever the application discovers concurrent sessions it should always notify the user\nabout this and should give him the opportunity to end the other sessions."},
{"Id": 181, "Ques": ["What is Auto escaping technology ?", "What does Auto escaping technology mean ?", "Tell me something about Auto escaping technology ?", "Auto escaping technology"],"Ans": "Some frameworks/templates have the option to autoescape all incoming userinput to harmless\nencoded data in order to prevent attacks. However, this autoescaping functionality is also\noptional to be disabled. Whenever this autoescaping function has been disabled your application\nmight be vulnerable to attacks like XSS."},
{"Id": 182, "Ques": ["What is Client side storage ?", "What does Client side storage mean ?", "Tell me something about Client side storage ?", "Client side storage"],"Ans": "Client side storage also known as Offline Storage or Web Storage. The Underlying storage mechanism may vary from one\nuser agent to the next. In other words, any authentication your application requires can\nbe bypassed by a user with local privileges to the machine on which the data is stored.\nTherefore, it's recommended not to store any sensitive information in local storage."},
{"Id": 183, "Ques": ["What is Log rotation and seperation ?", "What does Log rotation and seperation mean ?", "Tell me something about Log rotation and seperation ?", "Log rotation and seperation"],"Ans": "Log separation is indispensable in order to prevent it from either radically downgrading your\napplication its performance or even causing a Denial of service because the server becomes\nunavailable due to the flooding of logs."},
{"Id": 184, "Ques": ["What is HTTP strict transport security ?", "What does HTTP strict transport security mean ?", "Tell me something about HTTP strict transport security ?", "HTTP strict transport security"],"Ans": "HTTP Strict Transport Security (HSTS) is an optin security enhancement that is specified\nby a web application through the use of a special response header. Once a supported browser\nreceives this header that browser will prevent any communications from being sent over\nHTTP to the specified domain and will instead send all communications over HTTPS. It also\nprevents HTTPS click through prompts on browsers. "},
{"Id": 185, "Ques": ["What is API resonses security headers ?", "What does API resonses security headers mean ?", "Tell me something about API resonses security headers ?", "API resonses security headers"],"Ans": "There are some security headers which should be properly configured in order to protect some API callbacks against Reflective File Download and other type of injections."},
{"Id": 186, "Ques": ["What is Do not support untrusted client side technologies ?", "What does Do not support untrusted client side technologies mean ?", "Tell me something about Do not support untrusted client side technologies ?", "Do not support untrusted client side technologies"],"Ans": "When using unsupported client side technologies which are not supported natively via\nW3C browser standards. Your application could be open to different types of attacks."},
{"Id": 187, "Ques": ["What is Signed message payloads ?", "What does Signed message payloads mean ?", "Tell me something about Signed message payloads ?", "Signed message payloads"],"Ans": "In order to establish trust between two communicating party's such as servers and clients\nthere message payload should be signed by means of public/private key method. This builds trust\nand makes it harder for attackers to impersonate different users."},
{"Id": 188, "Ques": ["What is Hardware key vault ?", "What does Hardware key vault mean ?", "Tell me something about Hardware key vault ?", "Hardware key vault"],"Ans": "Keys should remain in a protected key vault at all times. In particular, ensure that there\nis a gap between the threat vectors that have direct access to the data and the threat\nvectors that have direct access to the keys. This implies that keys should not be stored\non the application or web server (assuming that application attackers are part of the\nrelevant threat model)."},
{"Id": 189, "Ques": ["What is SOAP basic profile ?", "What does SOAP basic profile mean ?", "Tell me something about SOAP basic profile ?", "SOAP basic profile"],"Ans": "Simple Soap Binding Profile is a specification from the Web Services Interoperability industry consortium. It\nis intended as a support profile for the WSI Basic Profile. This profile defines the way WSDL\ndocuments are to bind operations to a specific transport protocol SOAP."},
{"Id": 190, "Ques": ["What is Strong CRYPTO through CA hierachy ?", "What does Strong CRYPTO through CA hierachy mean ?", "Tell me something about Strong CRYPTO through CA hierachy ?", "Strong CRYPTO through CA hierachy"],"Ans": "When you have an offline PKI setup you need to have solid strong crypto layers.\nAn attacker will look for weak chains in the hierarchy and abuse them when found.\nThis can lead to ManInTheMiddle (MITM) attacks and impact the 3 security pillars C.I.A (Confidentiality, Integrity and Availability)."},
{"Id": 191, "Ques": ["What is Build and deploy in a secure fashion ?", "What does Build and deploy in a secure fashion mean ?", "Tell me something about Build and deploy in a secure fashion ?", "Build and deploy in a secure fashion"],"Ans": "Using build platforms on premise or as a service is one of the core components in a SDLC.\nThese build and deploy servers are sometimes not perfect for performing secure builds or deploys.\nThis is because the lack of hardening of the OS for security improvements where the application\ncould also benefit from this hardening. Also the access of third party services can lead to\ncompromise of the secrets or integrity of the code of the application."},
{"Id": 192, "Ques": ["What is Signed application components ?", "What does Signed application components mean ?", "Tell me something about Signed application components ?", "Signed application components"],"Ans": "When an application don't use signed components an attacker can easily modify parts\nof the application and load inject a backdoors. Also the attacker could\nmodify business logic in the application without notice. Signed application\ncomponents can help harden your application and make it noticeable when an attacker tries to\nmodify the code."},
{"Id": 193, "Ques": ["What is Build proccess security hardening ?", "What does Build proccess security hardening mean ?", "Tell me something about Build proccess security hardening ?", "Build proccess security hardening"],"Ans": "Building an application should always be done on a server that you trust, you are in control of and\nhas the latest security patches and hardening configured. In some applications you can use security\ntechniques and modules that can protect your application from known security issues. Always use these\ntechniques when they are available."},
{"Id": 194, "Ques": ["What is Sanitize unstructured data ?", "What does Sanitize unstructured data mean ?", "Tell me something about Sanitize unstructured data ?", "Sanitize unstructured data"],"Ans": "Verify that unstructured data is sanitized to enforce generic safety measures. When this is not\nsetup an attacker can use this unstructured data to harm the application and perform injections."},
{"Id": 195, "Ques": ["What is Zero keys and secrets before destroying them ?", "What does Zero keys and secrets before destroying them mean ?", "Tell me something about Zero keys and secrets before destroying them ?", "Zero keys and secrets before destroying them"],"Ans": "Attackers are always on the lookout for secrets of a server or computer. When these secrets are\naccessible for an attacker because the key was not properly being destroyed then this can lead to\nsecurity vulnerabilities. All secrets and keys should be completely erased from the memory since \nan attacker could otherwise potentially retrieve these keys with memory dumping attacks on the application."},
{"Id": 196, "Ques": ["What is Keys and passwords should be replaceable ?", "What does Keys and passwords should be replaceable mean ?", "Tell me something about Keys and passwords should be replaceable ?", "Keys and passwords should be replaceable"],"Ans": "It always can happen that you need the keys or the passwords of the application or in components\nthat are needed by the application to work in a secure state. When these keys needs to be revoked\nbecause the password was leaked or an administrator leaving the company it's always smart to have\nthe possibility to revoke the keys or passwords without too much problems."},
{"Id": 197, "Ques": ["What is Enforce random numbers are created with proper entropy at runtime ?", "What does Enforce random numbers are created with proper entropy at runtime mean ?", "Tell me something about Enforce random numbers are created with proper entropy at runtime ?", "Enforce random numbers are created with proper entropy at runtime"],"Ans": "There are some techniques attackers use to decrease the entropy pool of the system so it will\ncreate weak and predictable 'random' numbers that should not be used in crypto functions."},
{"Id": 198, "Ques": ["What is Segregated components ?", "What does Segregated components mean ?", "Tell me something about Segregated components ?", "Segregated components"],"Ans": "It's always possible that an attacker can find a security flaw and abuse this to gain access\nto the server. From here the attacker tries to further infiltrate into the network and other\nimportant components of the application for example the database. This database should be firewalled\ncorrectly so it's not accessible from the internet. Also this database has it own server and is in a\ndifferent segment of the network. Always apply INGRESS and EGRESS filtering for all the servers used."},
{"Id": 199, "Ques": ["What is PII protection ?", "What does PII protection mean ?", "Tell me something about PII protection ?", "PII protection"],"Ans": "There should be extra care taken into account when you are dealing with PII(personal identifiable information) in your\napplication. There are multiple laws in countries that demand proper protection by\nmeans of SSL/TLS for when the data is in transit and encrypted with pub priv key system\nwhen stored on the disk. This is needed to protect the user from identity theft and fraud."},
{"Id": 200, "Ques": ["What is Verify application is not vulnerable for known security issues ?", "What does Verify application is not vulnerable for known security issues mean ?", "Tell me something about Verify application is not vulnerable for known security issues ?", "Verify application is not vulnerable for known security issues"],"Ans": "Whenever security researchers find a vulnerability in a library, modules, frameworks, platforms or \noperating system, these vulnerabilities are reported and saved in the CVE list. "},
{"Id": 201, "Ques": ["What is Disable autocomplete for all the input fields in forms ?", "What does Disable autocomplete for all the input fields in forms mean ?", "Tell me something about Disable autocomplete for all the input fields in forms ?", "Disable autocomplete for all the input fields in forms"],"Ans": "Browser autocomplete and password managers could be used by attackers to steal sensitive\ninformation. Whenever an application is susceptible to XSS (Cross site scripting) attacks,\nthe attacker can inject forms into the application which are autocompleted by the browser."},
{"Id": 202, "Ques": ["What is All time sources should be synchronized ?", "What does All time sources should be synchronized mean ?", "Tell me something about All time sources should be synchronized ?", "All time sources should be synchronized"],"Ans": "All time sources must be synchronized throughout. For example, different API servers or \nmicroservices. to prevent logs to be tainted and become unusable for forensics."},
{"Id": 203, "Ques": ["What is Generate strong crypto tokens with at least 120 bit of effective entropy ?", "What does Generate strong crypto tokens with at least 120 bit of effective entropy mean ?", "Tell me something about Generate strong crypto tokens with at least 120 bit of effective entropy ?", "Generate strong crypto tokens with at least 120 bit of effective entropy"],"Ans": "ID values stored on the device such as IMEI and UDID should not be used as authentication tokens. \nThese tokens are retrievable by other applications and thus warrant no integrity.\n \nUsing ID values from the mobile device also implies the use of static API tokens which is considered\ninsecure. These tokens cannot for example, expire or be invalidated by the application.\n \nWhenever the application uses static tokens such as the ID values and this information is leaked by\na MiTM attack or leaked in another way then this attacker can now fully compromise the user without \nbeing able to reject to expire or invalidate the static token EMEI or UDID for example. "},
{"Id": 204, "Ques": ["What is Enforce sensitive information to be stored encrypted on device ?", "What does Enforce sensitive information to be stored encrypted on device mean ?", "Tell me something about Enforce sensitive information to be stored encrypted on device ?", "Enforce sensitive information to be stored encrypted on device"],"Ans": "The mobile application should not store sensitive data into unencrypted shared\nresources on the device. These resources can be accessible by other applications or \nphysically accessible whenever a device gets lost or stolen. "},
{"Id": 205, "Ques": ["What is Encrypt sensitive information different depending on context ?", "What does Encrypt sensitive information different depending on context mean ?", "Tell me something about Encrypt sensitive information different depending on context ?", "Encrypt sensitive information different depending on context"],"Ans": "The mobile application should not store sensitive data in an unencrypted manner, even in\nthe applications key chains since these can be easily accessed once a phone is jailbroken \nor exploited the keychain can be easily read. "},
{"Id": 206, "Ques": ["What is Secrets should be secure random generated ?", "What does Secrets should be secure random generated mean ?", "Tell me something about Secrets should be secure random generated ?", "Secrets should be secure random generated"],"Ans": "Secret keys, API tokens, or passwords must be dynamically generated. Whenever these tokens\nare not dynamically generated they can become predicable and used by attackers to compromise\nuser accounts. "},
{"Id": 207, "Ques": ["What is Protection against different exfiltration techniques ?", "What does Protection against different exfiltration techniques mean ?", "Tell me something about Protection against different exfiltration techniques ?", "Protection against different exfiltration techniques"],"Ans": "The mobile application should not leak sensitive information. This information could be leaked for example whenever:"},
{"Id": 208, "Ques": ["What is Principle of least privilege ?", "What does Principle of least privilege mean ?", "Tell me something about Principle of least privilege ?", "Principle of least privilege"],"Ans": "The application should always be request minimal permissions for required functionality and\nresources. This is also known as principle of least privilege. The principle of least privilege \nrecommends that accounts have the least amount of privilege required to perform their \nbusiness processes. This encompasses user rights, resource permissions such as CPU limits, \nmemory, network, and file system permissions. "},
{"Id": 209, "Ques": ["What is Protecting device memory ?", "What does Protecting device memory mean ?", "Tell me something about Protecting device memory ?", "Protecting device memory"],"Ans": "When critical functionality is loaded into the device memory and always in the same place and location \nthen an attacker is able to create a very stable exploit for the application. This can lead to abuse \nof the application business logic or stealing of sensitive information."},
{"Id": 210, "Ques": ["What is Enforce anti ?", "What does Enforce anti mean ?", "Tell me something about Enforce anti ?", "Enforce anti"],"Ans": "An attacker can use debug tooling to find out how the application is working and determain the \npossible attack surface by using tooling like GDB or running the application in an emulator. Using\nthese type of tooling the attacker can learn a lot about the tool and succesfully attack the application\nand have a higher change of succeeding."},
{"Id": 211, "Ques": ["What is Protect sensitive activities intents or content providers ?", "What does Protect sensitive activities intents or content providers mean ?", "Tell me something about Protect sensitive activities intents or content providers ?", "Protect sensitive activities intents or content providers"],"Ans": "The application should never export sensitive activities, intents, or content providers.\nThese activities could than potentially be exploited by third party applications installed\non the same device."},
{"Id": 212, "Ques": ["What is Mitigate memory dumping attacks ?", "What does Mitigate memory dumping attacks mean ?", "Tell me something about Mitigate memory dumping attacks ?", "Mitigate memory dumping attacks"],"Ans": "Whenever sensitive information in stored in the devices’ memory, this information can \nbe dumped by various tool such as “android debugger (ADB)“ on android devices. This \ninformation could give critical information about the application and could aid attackers \nin their attacks."},
{"Id": 213, "Ques": ["What is Protect agains exported activities or content providers ?", "What does Protect agains exported activities or content providers mean ?", "Tell me something about Protect agains exported activities or content providers ?", "Protect agains exported activities or content providers"],"Ans": "Whenever input from exported activities intents or content provided is not properly validated\nthis input could potentially exploit vulnerabilities on the mobile application depending on\nthe context in where the input is being used."},
{"Id": 214, "Ques": ["What is Block common password and weak passphrases ?", "What does Block common password and weak passphrases mean ?", "Tell me something about Block common password and weak passphrases ?", "Block common password and weak passphrases"],"Ans": "Applications should encourage the use of strong passwords and passphrases. Preferably the\npassword policy should not put limitations or restrictions on the chosen passwords.\nWhenever the application supports strong passwords and the use of password managers, the\npossibility for an attacker performing a succesfull bruteforce attack drops significally."},
{"Id": 215, "Ques": ["What is Application assets hosted on secure location ?", "What does Application assets hosted on secure location mean ?", "Tell me something about Application assets hosted on secure location ?", "Application assets hosted on secure location"],"Ans": "Whenever application assets such as JavaScript libraries or CSS styleshees are not hosted\non the application itself but on a external CDN which is not under your control these\nCDNs' can introduce security vulnerabilities. Whenever one of these CDN gets compromised\nattackers can include malicious scripts. Also whenever one of these CDNs' get out of service\nit could affect the operation of the application and even cause a denial of service."},
{"Id": 216, "Ques": ["What is CSRF on REST ?", "What does CSRF on REST mean ?", "Tell me something about CSRF on REST ?", "CSRF on REST"],"Ans": "CrossSite Request Forgery (CSRF) is a type of attack that occurs when a malicious Web site,\nemail, blog, instant message, or program causes a users Web browser to perform an unwanted\naction on a trusted site for which the user is currently authenticated."},
{"Id": 217, "Ques": ["What is File ?", "What does File mean ?", "Tell me something about File ?", "File"],"Ans": "I/O commands allow you to own, use, read from, write to, close devices and To direct I/O operations to a device.\nWhenever user supplied input i.e file names and/or file data is being directly used in these commands, this could lead \nto path traversal, local file include, file mime type, and OS command injection vulnerabilities."},
{"Id": 218, "Ques": ["What is File upload anti virus check ?", "What does File upload anti virus check mean ?", "Tell me something about File upload anti virus check ?", "File upload anti virus check"],"Ans": "whenever files from untrusted services are uploaded to the server, there should be additional checks\nin place to verify whether these files contain viruses (malware, trojans, ransomware). "},
{"Id": 219, "Ques": ["What is File upload outside document root ?", "What does File upload outside document root mean ?", "Tell me something about File upload outside document root ?", "File upload outside document root"],"Ans": "Files that are uploaded by users or other untrusted services should always be placed outside\nof the document root. This is to prevent malicious files from being parsed by attackers such as PHP files."},
{"Id": 220, "Ques": ["What is Unauthorized and unauthenticated access security logs ?", "What does Unauthorized and unauthenticated access security logs mean ?", "Tell me something about Unauthorized and unauthenticated access security logs ?", "Unauthorized and unauthenticated access security logs"],"Ans": "Security logs should never allow unauthorized/unauthenticated access because these files include\na lot of sensitive information and could assist an attacker in leveraging attacks. Whenever\nthese logs can be accessed and modified, attackers could also erase their presence and attack\ntrail they made to the application."},
{"Id": 221, "Ques": ["What is Commonly chosen weak passwords and passphrases ?", "What does Commonly chosen weak passwords and passphrases mean ?", "Tell me something about Commonly chosen weak passwords and passphrases ?", "Commonly chosen weak passwords and passphrases"],"Ans": "Whenever an attacker has enumerated usernames from an application the attacker could start\na bruteforce attack on the authentication functionality. Whenever users have common known weak\npasswords or passphrases there is a high probability that the attacker can compromise \nsome of the accounts on the application."},
{"Id": 222, "Ques": ["What is two factor authentication against username password disclosure ?", "What does two factor authentication against username password disclosure mean ?", "Tell me something about two factor authentication against username password disclosure ?", "two factor authentication against username password disclosure"],"Ans": "Whenever the users username and passwords are disclosed by an application on what ever fashion possible, the \nusers account should still be proteced by two factor authentication mechanisms to prevent attackers\nfrom logging in with the credentials."},
{"Id": 223, "Ques": ["What is Logging access control decisions ?", "What does Logging access control decisions mean ?", "Tell me something about Logging access control decisions ?", "Logging access control decisions"],"Ans": "Access control decisions must be logged for forensics in the case of brute force attacks. \nThe logs of the access controls can also help with keeping track of potential session hijacking\nattacks. Since it can be measured where users logged in from and how many concurrent sessions are active."},
{"Id": 224, "Ques": ["What is High value transactions ?", "What does High value transactions mean ?", "Tell me something about High value transactions ?", "High value transactions"],"Ans": "Whenever there are high value transactions a normal username/password static authentication method does\nnot suffice to ensure a high level of security. Whenever the application digests high level of transactions ensure that\nrisk based reauthentication, two factor or transaction signing is in place."},
{"Id": 225, "Ques": ["What is Verify that structured data is strongly typed and validated ?", "What does Verify that structured data is strongly typed and validated mean ?", "Tell me something about Verify that structured data is strongly typed and validated ?", "Verify that structured data is strongly typed and validated"],"Ans": "Whenever structured data is strongly typed and validated against a defined schema the application\ncan be developed as a defensible proactive application. The application can now measure everything\nthat is outside of its intending operation by means of the defined schema's and should be used to\nreject the input if the schema checks return false."},
{"Id": 226, "Ques": ["What is Logging guidelines to access sensitive information ?", "What does Logging guidelines to access sensitive information mean ?", "Tell me something about Logging guidelines to access sensitive information ?", "Logging guidelines to access sensitive information"],"Ans": "Whenever sensitive data is accessed by a user this event should be logged to later verify\nthe integrity of the access to the data. The same principle applies to whenever the data is collected\nand under which protection directives the data is accessed to."},
{"Id": 227, "Ques": ["What is Log injection ?", "What does Log injection mean ?", "Tell me something about Log injection ?", "Log injection"],"Ans": "Log injection problems are a subset of injection problem, in which invalid entries taken\nfrom user input are inserted in logs or audit trails, allowing an attacker to mislead\nadministrators or cover traces of an attack. Log injection can also sometimes be used to\nattack log monitoring systems indirectly by injecting data that monitoring systems will\nmisinterpret."},
{"Id": 228, "Ques": ["What is Validate the integrity of all security relevant configurations ?", "What does Validate the integrity of all security relevant configurations mean ?", "Tell me something about Validate the integrity of all security relevant configurations ?", "Validate the integrity of all security relevant configurations"],"Ans": "Only authorized administrators should have access to change securityrelevant configurations."},
{"Id": 229, "Ques": ["What is Trusted repositories ?", "What does Trusted repositories mean ?", "Tell me something about Trusted repositories ?", "Trusted repositories"],"Ans": "Whenever the components are loaded from untrusted repositories this could imply the \ncomponents are backdoored, outdated and cannot be trusted."},
{"Id": 230, "Ques": ["What is Sandboxing malicious code ?", "What does Sandboxing malicious code mean ?", "Tell me something about Sandboxing malicious code ?", "Sandboxing malicious code"],"Ans": "A sandbox is a security mechanism for separating running programs. \nIt is often used to execute untested code, or untrusted programs from \nunverified thirdparties, suppliers, untrusted users and untrusted websites. It's creating \nan extra layer of security where an attacker first needs to break out from."},
{"Id": 231, "Ques": ["What is Client side constraints ?", "What does Client side constraints mean ?", "Tell me something about Client side constraints ?", "Client side constraints"],"Ans": "Whenever constraints that are imposed on the client side are not enforced on the server side than\nthese constraints can be easily bypassed by means of an intercepting proxy. i.e whenever user should not \nbe able to edit a form by solely disabling the input fields, a potential attacker can edit these input \nfields on the client side as editable and still submit the form."},
{"Id": 232, "Ques": ["What is Context sensitive authorization ?", "What does Context sensitive authorization mean ?", "Tell me something about Context sensitive authorization ?", "Context sensitive authorization"],"Ans": "Whenever granting users different types of authorization throughout the application\nthe authorization grants should be granted and enforced outside of the attackers scope."},
{"Id": 233, "Ques": ["What is All access controls must fail securely ?", "What does All access controls must fail securely mean ?", "Tell me something about All access controls must fail securely ?", "All access controls must fail securely"],"Ans": "Handling errors securely is a key aspect of secure coding.\nThere are two types of errors that deserve special attention. The first is exceptions\nthat occur in the processing of a security control itself. It's important that these\nexceptions do not enable behavior that the countermeasure would normally not allow.\nAs a developer, you should consider that there are generally three possible outcomes\nfrom a security mechanism:"},
{"Id": 234, "Ques": ["What is Password leakage ?", "What does Password leakage mean ?", "Tell me something about Password leakage ?", "Password leakage"],"Ans": "After completing a password recovery functionality, the user should not be sent a plaintext\npassword to his email adress. The application should also under no circumstances disclose the old or current password\nto the users."},
{"Id": 235, "Ques": ["What is TLS implementation ?", "What does TLS implementation mean ?", "Tell me something about TLS implementation ?", "TLS implementation"],"Ans": "Whenever sensitive information is being sent over the application TLS must be applied in the application\nto prevent malicious attackers eavesdropping the network can look into and manipulate this\nsensitive information."},
{"Id": 236, "Ques": ["What is Screen scraping data harvest ?", "What does Screen scraping data harvest mean ?", "Tell me something about Screen scraping data harvest ?", "Screen scraping data harvest"],"Ans": "Whenever the application does not put a threshold on the number requests made to the server,\nscreen scraping and data harvesting tools can gather data and information."},
{"Id": 237, "Ques": ["What is Communication between components (low privileges) ?", "What does Communication between components (low privileges) mean ?", "Tell me something about Communication between components (low privileges) ?", "Communication between components (low privileges)"],"Ans": "If accounts for communicating between components have granted more privileges than\nnecessary, these accounts could impose a great threat whenever one of these components gets\ncompromised by attackers. "},
{"Id": 238, "Ques": ["What is TLS settings are in line with current leading practice ?", "What does TLS settings are in line with current leading practice mean ?", "Tell me something about TLS settings are in line with current leading practice ?", "TLS settings are in line with current leading practice"],"Ans": "TLS settings must always be in line with current leading practice. Whenever TLS\nsettings and ciphers get outdated, the TLS connection can be degraded/broken and used by\nattackers to eavesdrop on users traffic over the application."},
{"Id": 239, "Ques": ["What is Data retention policy ?", "What does Data retention policy mean ?", "Tell me something about Data retention policy ?", "Data retention policy"],"Ans": "For all the data gathered in an application, there should be set up a data retention policy\nto make sure all the data is removed from the application when it is no longer used. This reduces\nthe damage done by potential attackers when they get access to the applications data due to a breach."},
{"Id": 240, "Ques": ["What is authenticated data cleared from client storage ?", "What does authenticated data cleared from client storage mean ?", "Tell me something about authenticated data cleared from client storage ?", "authenticated data cleared from client storage"],"Ans": "All authenticated data should be removed from the browsers storage as soon as\nthe session is terminated. This reduces the possibility that a potential attacker gains\nsensitive authenticated information whenever the application is attacked."},
{"Id": 241, "Ques": ["What is File inclusion attack II ?", "What does File inclusion attack II mean ?", "Tell me something about File inclusion attack II ?", "File inclusion attack II"],"Ans": "The File Inclusion vulnerability allows an attacker to include a file, usually exploiting\na \"dynamic file inclusion\" mechanisms implemented in the target application.\nThe vulnerability occurs due to the use of usersupplied input without proper validation."},
{"Id": 242, "Ques": ["What is Sensitive information in code or online repositories ?", "What does Sensitive information in code or online repositories mean ?", "Tell me something about Sensitive information in code or online repositories ?", "Sensitive information in code or online repositories"],"Ans": "Whenever secrets, API keys, and passwords are stored in the applications source code an attacker\ncan potentially retrieve this sensitive information by i.e:"},
{"Id": 243, "Ques": ["What is Identify all components ?", "What does Identify all components mean ?", "Tell me something about Identify all components ?", "Identify all components"],"Ans": "Components are defined in terms of the business functions and/or security functions they provide.\nIt is easier for forensics to do their investigations whenever a breach has happened on an application."},
{"Id": 244, "Ques": ["What is Display concurrent and active sessions ?", "What does Display concurrent and active sessions mean ?", "Tell me something about Display concurrent and active sessions ?", "Display concurrent and active sessions"],"Ans": "Whenever the user is presented a summary of all concurrent sessions, this decreases a potentially\nsuccesful hijacking attack since the user can now see all sessions and terminate one whenever\nit does not feel trusted."},
{"Id": 245, "Ques": ["What is Password change leads to destroying concurrent sessions ?", "What does Password change leads to destroying concurrent sessions mean ?", "Tell me something about Password change leads to destroying concurrent sessions ?", "Password change leads to destroying concurrent sessions"],"Ans": "Whenever a user changes his password, the user should be granted the option\nto kill all other concurrent sessions. This countermessure helps to exclude\npotential attackers living on a hijacked session."},
{"Id": 246, "Ques": ["What is HSTS preload ?", "What does HSTS preload mean ?", "Tell me something about HSTS preload ?", "HSTS preload"],"Ans": "HTTP Strict Transport Security (HSTS) is an optin security enhancement that is specified by a \nweb application through the use of a special response header. Once a supported browser receives \nthis header that browser will prevent any communications from being sent over HTTP to the specified \ndomain and will instead send all communications over HTTPS. It also prevents HTTPS click through prompts on browsers."},
{"Id": 247, "Ques": ["What is Integrity check and authorised modification ?", "What does Integrity check and authorised modification mean ?", "Tell me something about Integrity check and authorised modification ?", "Integrity check and authorised modification"],"Ans": "The Current state of the data or program should be compared to the previous recorded in order to detect changes.\nThroughout the development of the application, there must be perpetual checks in place to check if all \npages and resources by default require authentication except those specifically intended to be public.\nSometimes developers simply forget to implement these checks, or they remove the checks temporarily \nfor testing purposes. "},
{"Id": 248, "Ques": ["What is Unauthorised access and modification ?", "What does Unauthorised access and modification mean ?", "Tell me something about Unauthorised access and modification ?", "Unauthorised access and modification"],"Ans": "Throughout the development of the application there must be perpetual checks in place to check\nif all pages and resources by default require authentication except those specifically intended to be public."},
{"Id": 249, "Ques": ["What is Identify and use only require functions if using components ?", "What does Identify and use only require functions if using components mean ?", "Tell me something about Identify and use only require functions if using components ?", "Identify and use only require functions if using components"],"Ans": "Applications have many different components that are needed for the business functions \nor for the security functions they provide. With many different components, there are\nalso possible vulnerabilities that can arise. Also, most of the components functions \nthat are delivered are not necessary needed and can introduce a vulnerability in a specific part\nthat may not be even used by the application. Also, these security issues in the components \nare publicly well know and documented. "},
{"Id": 250, "Ques": ["What is Centralized the mechanisms for protecting resources and the access ?", "What does Centralized the mechanisms for protecting resources and the access mean ?", "Tell me something about Centralized the mechanisms for protecting resources and the access ?", "Centralized the mechanisms for protecting resources and the access"],"Ans": "Applications have often different ways for granting access to protected resources, sometimes these are \ndone based on a role that is defined in a Database or using an Active Directory permission. Also, external\nauthorization services may be implemented and needed for the application. With all these different ways \nfor protecting resources and the access to these assets mistakes will be easily made. "},
{"Id": 251, "Ques": ["What is Third party components ?", "What does Third party components mean ?", "Tell me something about Third party components ?", "Third party components"],"Ans": "All third party components the application depends on to operate must be mapped in\nterms of the functions, and/or security functions, they provide for several reasons."},
{"Id": 252, "Ques": ["What is Policy for processing sensitive data ?", "What does Policy for processing sensitive data mean ?", "Tell me something about Policy for processing sensitive data ?", "Policy for processing sensitive data"],"Ans": "Some data on an application can be consider sensitive due to its importance:\n Social security number\n Credit card or banking information\nOr by the context of the information:\n Passphrase used as a password of an application\n University restricted or critical data"},
{"Id": 253, "Ques": ["What is Server side request forgery ?", "What does Server side request forgery mean ?", "Tell me something about Server side request forgery ?", "Server side request forgery"],"Ans": "Server Side Request Forgery (SSRF) attack, where an attacker abuse the functionality of a\nvulnerable web application to send crafter request which which read or update internal \nresources. Attacker can attack an internal network or application behind the firewall with\nthis attack which is normally not accessible through external network and even attack the\ninternal network web applications."},
{"Id": 254, "Ques": ["What is not available item ?", "What does not available item mean ?", "Tell me something about not available item ?", "not available item"],"Ans": "This item is currently not available."}
]
}